{"newspapers": {"foxnews_politics": {"link": "http://www.foxnews.com/politics", "articles": []}, "cnbc_politics": {"link": "https://www.cnbc.com/politics/", "articles": [{"title": "Australian stocks cautious following mixed finish on Wall Street", "text": "Overnight on Wall Street, the Dow Jones Industrial Average declined by 126.93 points to close at 25,317.41, while the S&P 500 slid by 0.4 percent to end at 2,755.88. The Nasdaq Composite advanced by 0.3 percent to close at 7,468.36.\n\nInvestors remain cautious over mounting geopolitical tensions around the world.\n\nA Saudi official provided this weekend a new account of the death of journalist Jamal Khashoggi, deviating from a prior official statement from Saudi Arabia. Khashoggi's death has led to global criticism toward Saudi Arabia and has sent ripple effects throughout global markets. Last week, foreign investors reportedly dumped more than $1 billion worth of Saudi stocks.\n\nMeanwhile, the U.S.-China trade war remain a focus for markets. A Chinese official told American investors at a meeting that Beijing did not \"fear\" a trade war with Washington.\n\n\"China never wants a trade war with anybody, not to mention the U.S., who has been a long term strategic partner, but we also do not fear such a war,\" Zhang Qingli, a leading member of a Chinese committee tasked with forging alliances with other nations, said through a translator at the meeting in Beijing. That was according to a meeting attendee who declined to be named.", "link": "https://www.cnbc.com/2018/10/23/asia-markets-saudi-arabia-us-china-trade-war-currencies-in-focus.html", "published": "2018-10-23T00:00:00"}, {"title": "Dow falls more than 100 points as Bank of America leads financial shares lower", "text": "Global economy is slowing and becoming more divergent, says El-Erian 9 Hours Ago | 01:32\n\nThe Dow Jones Industrial Average and S&P 500 closed lower on Monday as shares of big banks fell broadly. Worries about a deluge of corporate earnings reports coming this week and rising geopolitical tensions also dampened investor sentiment.\n\nThe 30-stock Dow fell 126.93 points to 25,317.41, led by losses in Goldman Sachs. The S&P 500 pulled back 0.4 percent to 2,755.88 as the financials sector dropped 2.1 percent. The Nasdaq Composite, however, gained 0.3 percent to close at 7,468.36 as Amazon and Apple rose 1.4 percent and 0.6 percent, respectively. Monday also marked the fourth straight day of losses for the S&P 500, while the Nasdaq snapped a three-day slide.\n\nBank of America and Citigroup both fell more than 3 percent. J.P. Morgan Chase and Goldman Sachs closed 1.4 percent and 2.4 percent lower, respectively. The SPDR S&P Bank ETF (KBE) fell 2.8 percent, posting its worst day since Oct. 10, when it pulled back 3.1 percent. Banks fell broadly amid worries that higher mortgage rates would cap loan growth.", "link": "https://www.cnbc.com/2018/10/22/wall-street-set-for-a-slightly-higher-open-amid-earnings.html", "published": "2018-10-22T00:00:00"}, {"title": "European markets close lower; Ryanair gains 4%", "text": "The pan-European Stoxx 600 initially rose with most sectors trading in positive territory. However those gains were given up after Italy vowed to stick to the draft budget. The pan-European index ended provisionally lower by 0.32 percent.\n\nItalian stocks had opened stiffly higher on Monday morning after a ratings downgrade by Moody's was deemed relatively benign. Shares in Italian banks rose and yields on Italian debt dropped after Moody's downgraded Italy by one notch, as expected, and gave a \"stable\" outlook to its sovereignty.\n\nBut the Italian treasury then published a letter on its website on Monday that said it was sticking to its controversial budget plan.\n\nLooking across the European benchmark, Fiat was among the top performers, up more than 2.98 percent by the end of trade. This followed news that the company had agreed to sell its Magneti Marelli unit to a Japanese company for $7.1 billion, Reuters reported. At the other end was Philips, the stock was down 8.69 percent, after missing analysts' expectations with its third-quarter results.\n\nMarket focus was mostly on corporate earnings with several big stocks announcing their latest results. Shares of Ryanair rose more than 4 percent despite reporting lower-than-expected profits in the second quarter of its fiscal year. The airline also announced significant progress with employees to prevent further strikes and investments to ensure on-time departures.\n\nIn Asia, Chinese stocks rallied as much as 4 percent on the back of news that authorities took steps to support the market. This followed weaker growth figures out last week.\n\nIn the United States stocks kicked off the week trading higher on Monday as a big rally in Chinese shares and easing worries over Italy's budget lifted investor sentiment. However markets flipped direction as sellers overpowered buyers.", "link": "https://www.cnbc.com/2018/10/22/european-markets-corporate-earnings-italy-brexit-in-focus.html", "published": "2018-10-22T00:00:00"}, {"title": "Gold falters as rising dollar dents appeal", "text": "Gold prices slipped on Monday, pressured by a rallying dollar and the metal's failure to break above a key technical level.\n\nSpot gold fell 0.37 percent to $1,2210 per ounce, having hit a 2-1/2-month peak last week at $1,233.26 per ounce.\n\nPrices were on track to register their biggest daily percentage decline since Oct. 12.\n\nU.S. gold futures settled down $1.40 at $1,228.70 per ounce.\n\n\"The strength of the dollar and the gold market's inability to trade above the 100 day moving average (at $1,224) has given people the impression that gold has no chance of rallying,\" said Walter Pehowich, executive vice president of investment services at Dillon Gage Metals.\n\nThe dollar rose against a basket of major currencies, denting demand for gold, which is priced in the U.S. currency, while Wall Street failed to capitalize on gains in European and Asian stock markets.\n\nDespite the market gathering a fair amount of technical momentum last week, breaking free of stock market fluctuations, some analysts said the outlook was not straightforward.\n\n\"The fundamental outlook for gold is still looking a little bleak despite the recent recovery, so I would not be surprised if gold was to falter from here,\" said Fawad Razaqzada, an analyst with Forex.com.\n\nGold speculators cut their net short position in COMEX gold contracts by 65,637 contracts to 37,372 contracts, the smallest since late July, in the week to Oct. 16, data showed.\n\nIn other precious metals, palladium surged 3.54 percent to $1,118.80 per ounce, having hit its highest in more than nine months at $1,123.20.\n\nThe autocatalyst metal has seen fresh buying on the back of a recovery in Chinese equity markets, said Pehowich. Industrial commodities tend to benefit from sharper appetite for risk.\n\nPromises of tax cuts and coordinated official statements of support for stock markets in the world's second-largest economy saw Chinese shares stage their biggest one-day surge in three years.\n\nMeanwhile, silver was 0.29 percent lower at $14.55, while platinum slid 1.44 percent, to $818.05.", "link": "https://www.cnbc.com/2018/10/22/gold-markets-asian-stocks-saudi-arabia-italy-brexit-in-focus.html", "published": "2018-10-22T00:00:00"}]}, "washingtonpost_politics": {"link": "https://www.washingtonpost.com/politics/", "articles": [{"title": "Student sues Sen. David Perdue for snatching his phone when he asked about voting rights", "text": "A Georgia student who says Sen. David Perdue (R-Ga.) snatched his cellphone away this month as he tried to ask about possible voter suppression in the state has filed a lawsuit against the lawmaker for battery.\n\nAttorneys for Nathan Knauf, a junior at Georgia Tech, filed the complaint in Fulton County State Court on Monday morning, seeking a jury trial, unspecified damages, attorneys' fees and others costs from Perdue.\n\nPerdue’s office has maintained that the exchange was a misunderstanding and that the senator took the student’s phone to take a selfie. On Monday, Perdue’s office called the lawsuit “outrageous and completely frivolous.”\n\nThe incident took place Oct. 13, when Perdue visited Georgia Tech to campaign for Georgia Secretary of State Brian Kemp, a fellow Republican who is locked in a tight gubernatorial race with Democrat Stacey Abrams.\n\nKnauf, a student member of the Young Democratic Socialists of America, approached Perdue and began asking about Kemp — who has been accused of suppressing thousands of minority voters — while recording video on his cellphone.\n\n“Hey, so, uh, how can you endorse a candidate,\" Knauf began.\n\nBefore he could continue, Perdue snatched the phone out of his hands.\n\n“No, I’m not doing that. I’m not doing that,” the senator can be heard saying in the cellphone recording.\n\n“You stole my property,” Knauf tells Perdue. “You stole my property.”\n\nToday @sendavidperdue visited Tech to campaign for Kemp. A student tried asking a simple question about @BrianKempGA 's racist scheme to threaten voter registrations from black people, but before he could even finish the question, Perdue stole his phone. pic.twitter.com/K0iffU57Di — YDSA Georgia Tech (@YDSAGT) October 13, 2018\n\n“All right, you wanted a picture?” the senator replies.\n\n“Give me my phone back, Senator,” Knauf says.\n\n“You wanted a picture? I’m going to give it to you,” Perdue continues, ignoring the student’s request. “You wanted a picture?”\n\n“Give me my phone back, Senator,” Knauf repeats.\n\nAt this point, the video rights itself again, apparently because Knauf is reunited with his phone. By then, Perdue is walking away on a crowded pedestrian pathway.\n\nThe following day, Perdue’s office characterized the exchange as a misunderstanding and said the senator had spent several hours meeting with hundreds of people at a Georgia Tech game over the weekend.\n\n“The senator spoke with many students and answered questions on a variety of topics,” Perdue spokeswoman Casey Black said in a statement at the time. “In this instance, the senator clearly thought he was being asked to take a picture, and he went to take a selfie as he often does. When he realized they didn’t actually want to take a picture, he gave the phone back.”\n\nKnauf’s attorneys said Knauf and two friends had asked Perdue to take a picture with them but had not agreed to hand over his phone. The complaint states that Perdue “could not have thought that Mr. Knauf had somehow changed his mind and now wanted a selfie taken.”\n\nMichael Sterling, one of Knauf’s attorneys, argued that the video evidence does not corroborate Perdue’s explanation.\n\n“This is a first-year law school definition of battery,” Sterling said. “Perdue starts by saying ‘No, I’m not doing that,’ and then snatches the phone. Then Perdue puts the phone behind his back. There’s no actions that are consistent with the fact that he was going to take a selfie. He doesn’t put the phone up. . . . Nate is asking for his phone back. That’s completely inconsistent with [Perdue’s] version of the story.”\n\n[A senator snatched a student’s phone while being asked about Georgia voter registration uproar]\n\nGeorgia state Rep. David Dreyer (D), another of Knauf’s attorneys, said they opted to file a civil complaint rather than a criminal one.\n\n“We think he should be held accountable, but we didn’t think it rose to the level of trying to have him prosecuted,” Dreyer said of Perdue. “By filing a lawsuit, we are empowering a jury to determine whether Nate’s story is right or whether Senator Perdue’s story is right.”\n\nKnauf’s attorneys said the student would be willing to dismiss the civil complaint if Perdue issued an apology “for both misleading the public and for trying to intimidate him,” and also to answer Knauf’s original question about his support for Kemp.\n\n“The two issues at stake here are [about] democracy: Can an individual, an everyday person, go up to their elected representative and ask a question in a public forum?” Dreyer said. “And does the rule of law apply — whether it’s a college student or a multimillionaire U.S. senator? Because we know if Mr. Knauf had taken the phone from Sen. Perdue, he would have been put in jail.”\n\nIn a statement Monday morning, Perdue’s office characterized the lawsuit as one being “politically orchestrated by Georgia Democrats.”\n\n“The senator was simply asked to take a picture and went to take a selfie as he often does with hundreds of people,” Black said. “The senator was also not ignoring their questions, in fact, he had just finished answering several students’ questions about climate change.”\n\nShe added: “Sadly, but not surprisingly, this is another attempt by liberal activists to distort the facts and distract the people of Georgia just weeks before an election.”\n\n[Georgia’s GOP gubernatorial candidate Brian Kemp is sued over claims of suppressing thousands of minority voters]\n\nWhen asked to respond to the student’s offer to dismiss the complaint if Perdue apologized, the senator’s spokeswoman said in a follow-up statement that “Georgia Democrats have taken their extreme tactics too far\" and called Knauf’s attorneys “political hacks who are trying to spin something out of nothing.”\n\n“This is being orchestrated by a former Obama operative and current Democrat state representative who spends most of his time campaigning for Stacey Abrams,” she stated. \"Georgians will see this for what it is — a manufactured setup to embarrass the Senator and attack his credibility two weeks before the midterm elections. Instead, Democrats are embarrassing themselves with a frivolous case that will only waste the court’s time.”\n\nThe Georgia governor’s race between Kemp and Abrams attracted national scrutiny this month after the Associated Press reported that more than 53,000 voter registration applications were in limbo with Kemp’s office; the overwhelming majority of those applications are from African American and other minority voters, according to an AP analysis.\n\nAbrams has accused Kemp of voter suppression and of using his position to try to swing the gubernatorial race in his favor. Kemp has defended his office by saying it was simply complying with an “exact match” state law that requires election officials to put a registration application on hold if there are even minor discrepancies with existing records (for instance, a typo or an extra hyphen in a name).\n\nThe controversy escalated when a coalition of civil rights groups sued Kemp over the exact-match law, arguing that it disproportionately and unfairly affects minority voters.\n\nPolls show the race between Kemp and Abrams is a toss-up.\n\nThis post has been updated.\n\nRead more:\n\nGuardian reporter calls GOP congressman who hit him a coward — and calls Trump something worse\n\n‘Who did this?!’: Someone put googly eyes on a historic Georgia statue. Police want answers.\n\nSelf-described ‘communists’ tried to donate to a Democrat. They were actually GOP activists.\n\nHow Georgia’s registration laws put a thumb on the scales for Republican candidates", "link": "https://www.washingtonpost.com/politics/2018/10/22/student-sues-sen-david-perdue-snatching-his-phone-when-he-asked-about-voting-rights/", "published": "2018-10-22T00:00:00"}, {"title": "Another French priest accused of sexual assault commits suicide", "text": "\n\nPierre-Yves Fumery, 38, was found Saturday after hanging himself at his residence in the town of Gien, according to news reports. (iStock)\n\nA French priest committed suicide after being accused of sexual misconduct, according to European news reports — the second to do so in a month.\n\nPierre-Yves Fumery, 38, was found Saturday after hanging himself at his residence in the town of Gien, the BBC and Agence France-Presse reported.\n\nLast month, another 38-year-old priest, Jean-Baptiste Sebe, killed himself in the northern French town of Rouen after being accused by a mother that her adult daughter had been a victim of “indecent behavior and sexual assault,” according to AFP.\n\nProsecutor Loic Abrial told the AFP that Fumery was questioned about sexual assault allegations involving a child under the age of 15 last week.\n\nJacques Blaquart, the bishop of Orleans, whose diocese includes Gien, said it was a “moment of suffering and a tragic ordeal,” according to AFP.\n\nSome members of Fumery’s parish had complained of “inappropriate behavior” on the part of the priest toward children between the ages of 13 and 15. One such example was a girl “that he took in his arms and drove home several times,” Blaquart said, according to local reports.\n\n[Justice Department investigates abuse by Catholic clergy in Pennsylvania]\n\nBlaquart had told Fumery to take some time off to seek counseling and leave town after the allegations surfaced but said that the claims did not merit being reported to the authorities, the BBC and AFP reported. The priest had only recently returned to Gien after a break.\n\nScrutiny on the issue of child sexual abuse has intensified in the wake of an August report from a grand jury in Pennsylvania that found more than 300 Catholic priests had abused children over seven decades while they were protected by church leaders.\n\nThe product of an 18-month investigation into six dioceses in the state, the report identified at least 1,000 child victims and noted that there were probably thousands more.\n\nThe Justice Department has launched an investigation into the allegations, it was disclosed last week.\n\nThe Washington Post’s Devlin Barrett, Julie Zauzmer and Michelle Boorstein wrote:\n\nThe decision to launch such a probe, even one limited to a single state, is noteworthy because the federal government has long shied away from tackling allegations that the church spent decades hiding the extent of the sexual abuse problem among its priests and that it allowed pedophiles to continue to work and live undetected in communities.\n\nRead more:\n\nMore than 300 accused priests listed in Pennsylvania report on Catholic Church sex abuse\n\nUtah refused to prosecute their sexual assault cases, so four women set out to do it themselves\n\nA ‘Fox & Friends’ voter panel rebels when asked about the migrant caravan\n\nA ‘headless chicken monster’ sighting shows just how little we know about the ocean off Antarctica", "link": "https://www.washingtonpost.com/religion/2018/10/22/another-french-priest-accused-sexual-assault-commits-suicide/?utm_term=.f2ee3e559af7", "published": "2018-10-22T00:00:00"}, {"title": "Utah refused to prosecute four sexual assault cases, so the alleged victims set out to do it themselves", "text": "One petitioner was a 17-year-old high school senior when she alleged that a classmate had raped her. Another claimed her co-worker had assaulted her. The third petitioner accused a police chief of raping her several times while she was volunteering in his department. And the fourth, now 30, said she was assaulted by a massage therapist.\n\nAll four cases were reviewed by the local prosecutor’s office, which declined to file charges.\n\nNow the four Utah residents are using a novel approach to make their voices heard: a provision in the state’s constitution that permits alleged crime victims to request that the state Supreme Court appoint a prosecutor if a district attorney refuses a case.\n\nThe constitutional clause is unique to Utah, but the concept of victim-initiated prosecution is available in other states.\n\nAttorneys for the women are optimistic that if they succeed in Salt Lake County, the ruling will create a viable blueprint for other states.\n\nSalt Lake County District Attorney Sim Gill called the petition an “intriguing thing that’s never been challenged.” Still, Gill joins a number of lawyers who worry that a successful lawsuit will pave the way for thousands of frivolous petitions in many types of cases.\n\nIn the past two years, all four women — known in their recently filed lawsuit as “the Jane Does” — said they were attacked by someone they knew and reported the assault within days.\n\nJane Doe 1, now 18, told The Washington Post that she hopes to help other victims be heard.\n\nAfter the Salt Lake County District Attorney’s Office declined to prosecute the case, the teenager’s high school allowed her alleged rapist back on campus.\n\n“It made me feel so vulnerable and scared,” she said. “We think the law will protect those who have been wronged. I don’t want another girl going through this again. I want to make it easier to get help and to have the law believe you.”\n\nThe lawsuit is the first time in Utah’s 120-year history that anyone has approached the issue this way, Paul Cassell, a former federal judge and professor at the University of Utah’s S.J. Quinney College of Law, told The Post.\n\nHistorically, the nation rarely questions a law enforcement decision to decline bringing charges. “The sexual assault under-prosecution problem is forcing people to reevaluate that,” he said.\n\nInstead of requesting sweeping interference with law enforcement decisions, the lawsuit asks for a specific ruling on a case that has been turned down for prosecution.\n\n[Police in many states could legally have sex with a person in custody — until a N.Y. rape allegation]\n\nThe suit comes amid heated national dialogue about sexual abuse, as the #MeToo movement has emboldened more women to speak out. It was further fueled by the confirmation hearings of Supreme Court Justice Brett M. Kavanaugh, which were shadowed by outrage over decades-old allegations of sexual assault.\n\nThe consensus, according to attorney Bethany Warr, who represents three of the Jane Does, is that sexual assault cases are under-prosecuted, though there are places where it’s more pronounced than others.\n\n“They have a tendency to be declined by district attorneys, and fairly so — they’re difficult cases,” Warr said. The lawsuit aims to further the dialogue about why juries are so hard on sex-crime victims and why society has such a hard time believing them, she said.\n\nSex-crime prosecutions are widely accepted as some of the most challenging in the criminal justice system.\n\nSexual assaults rarely happen with other witnesses present, and anything that deviates from the cliche of a masked, armed man committing a rape in an alleyway adds a variable that must be explained to frequently judgmental juries.\n\nIn Salt Lake County, Cassell said, assistant district attorneys operate under outdated notions of what cases are winnable, saying that prosecutors who are fearful of losing are the real barrier to successful prosecutions.\n\nGill, who is up for reelection this year, agreed that these are difficult cases for prosecutors. But, he said, that doesn’t mean his office refuses to prosecute them.\n\nAn average of 44 percent of violent crimes are reported to law enforcement and result in arrest, according to a statement released by Gill on Tuesday. Sexual crimes, he said, vary dramatically.\n\nIn Utah, 12 percent are brought forward — meaning 88 of 100 people fail to report sexual assault claims, Gill told The Post. He also said that last year, his office filed charges in 39 to 40 percent of 600 sexual assault reports, consistent with the national average.\n\nGill said there’s a social stigma associated with sexual assault, and because only a small percentage are reported, a systemic attrition happens.\n\n“We need to figure out what the balance is — to reassure victims that we see and hear them, while asking if the interests of justice will be met by bringing the case forward. Can we meet the legal burden in good faith?”\n\nGill pointed out that sexual assault cases have nuanced complexity. One major consideration, he said, is whether to re-traumatize a victim by having her testify in a case that would be challenging to win.\n\nDeborah Tuerkheimer, a professor at Northwestern University’s School of Law and a former prosecutor, said, “The problem with prosecutors is that they’re not just thinking about legal sufficiency, they’re thinking about convictability” — the likelihood that 12 jurors can be convinced beyond a reasonable doubt. “Often, jurors are unpersuaded because of biases and rape myths. When prosecutors take that into account in charging decisions, even anticipatorily, they’re embedding them into the system.”\n\nThe #MeToo movement heightened awareness of the prevalence of sexual assault. Part of the benefit is that people better understand what sexual violence looks like, which mitigates assumptions about the type of person who perpetrates these crimes and how a survivor “should” behave, Tuerkheimer said.\n\nThe petitioners remain hopeful that the Utah Supreme Court, which has the petition under advisement, will direct the attorney general’s office and other government agencies to file briefs in response.\n\nEach of the Jane Does wants to fight for the right to hold her alleged abuser accountable. Jane Doe 4 told the Salt Lake Tribune: “I did everything that I needed to do and I did it as strongly as I could,” she said. “I didn’t realize how disappointing and heartbreaking it would be.”\n\nBy putting their stories into circulation, they hope to challenge old injustices and forge change within the criminal justice system.\n\nRead more:\n\nFormer state GOP official warns Trump protesters: Montana is an ‘open carry state’\n\nA black child’s backpack brushed up against a woman. She called 911 to report a sexual assault.\n\nVideo shows woman leaving toddler on stranger’s doorstep in Texas and running away", "link": "https://www.washingtonpost.com/nation/2018/10/22/utah-refused-prosecute-their-sexual-assault-cases-so-four-women-set-out-do-it-themselves/?utm_term=.209c151f74d8", "published": "2018-10-22T00:00:00"}, {"title": "Migrant caravan: Fox News panel on border-bound caravan in Mexico goes awry", "text": "\n\n\"Fox & Friends\" co-hosts Steve Doocy, left, Ainsley Earhardt and Brian Kilmeade on their set in New York in January. (Richard Drew/AP)\n\nReporter\n\nSteve Doocy was about 30 seconds into Monday’s episode of “Fox & Friends” when he announced a Fox News alert.\n\n“We’ve got a Fox News alert!” he said.\n\n“FOX NEWS ALERT” blared a big red graphic on the screen.\n\nIt turned out to be pretty much the same alert “Fox & Friends” issued on Sunday, Saturday, Friday — and very possibly other episodes going back to mid-October: A caravan of migrants was slowly walking across Central America toward the U.S. border.\n\n“The migrant caravan in Central America is growing,” Doocy said when the alert graphic stopped obscuring his face.\n\n“Seven thousand strong!” said his co-host Ainsley Earhardt.\n\nThey cut to live footage of a Texas border city — approximately a 400-hour walk from the caravan’s position in southern Mexico — where a Fox News correspondent was stationed on the ground.\n\n“Is he going to be seeing 5,000 people storm the border soon?” asked Brian Kilmeade, the other co-host.\n\nYou might think so, to take a spin through the big conservative news sites.\n\n[Trump apparently misunderstands ‘Fox & Friends’ joke, makes baffling tweet]\n\nThe caravan was front and center on Breitbart and the Drudge Report on Monday, as it has been often since several hundred people formed it in Honduras around Oct. 12 and started walking north.\n\nMeanwhile, President Trump — “Fox & Friends” watcher-in-chief — just called the caravan a “National Emergy” on Twitter. Trump said the caravan has “Criminals and unknown Middle Easterners mixed in,” and the Mexican military can’t stop it, and also that it was organized by Democrats to hurt Republicans in the U.S. midterm elections.\n\nHave not seen a single “Middle Easterner” in the caravan, @realDonaldTrump. Have seen hundreds of women and children and babies, though. https://t.co/skzF0IEGCi — Kate Linthicum (@katelinthicum) October 22, 2018\n\nThe Washington Post, CNN, the Associated Press and many other mainstream outlets have covered the migrants' journey with considerably less foreboding, just as they did a smaller caravan that petered out before it reached the U.S. border earlier this year.\n\nAmong the 5,000 or so people who crossed the Guatemalan border into southern Mexico this weekend, Kevin Sieff reported for The Post, are a call center worker who grew up in the United States and wants to return; a wood-flooring installer who was deported from Phoenix six months ago and still has a 6-year-old son there; and uncounted families fleeing poverty or organized violence in their home countries.\n\nThey travel together for safety as they cross regions controlled by gangs and drug cartels. Most of them hope to seek asylum at the border or — more likely — to try to cross into the United States illegally.\n\nSo despite the caravan’s size, it’s no different in purpose than smaller mass migrations that routinely cross Central America.\n\nThe last one passed through last spring, drawing its own entourage of reporters and outraged tweets from Trump. It grew to about 1,000 people, which, it turned out, was too large for purposes of logistics, and so the caravan disbanded in Mexico City long before it reached the U.S. border.\n\nIt’s unclear how a group at least five times larger — apparently reliant on food and water from passersby — hopes to make it any farther.\n\nThat context was not in Monday’s Fox News alert.\n\nSome of it came across later in the episode — perhaps unintentionally — when Doocy brought out a panel of four people identified as independent voters and asked about the caravan.\n\n“It’s north of apparently 7,000 people strong,” Doocy told the first independent voter, Michael Willner. “How big a problem is that, that the United States has uneven immigration laws?”\n\n“I think uneven immigration laws are a problem for any country, and I think our immigration laws need to be modernized and updated,” Willner said.\n\n[‘He chose to blow it’: A rare dissent from the couch of ‘Fox & Friends’ after Trump attacks Ford]\n\n“But this country is founded on immigration,” he continued. “And all of us come from immigrants.”\n\nDoocy tried again.\n\n“By the time it gets here, it could be 10,000. It could be 20,000,” he said. “What should the United States do?”\n\n“This is the mightiest country on the planet,” Willner replied. “I think we can handle a caravan of people, unarmed, coming to this country.”\n\n“Okay,” Doocy said, pointing to the second independent voter. “Cathy: real quick.”\n\n“I think the immigration crisis we’re seeing is a result of the failure of the two democratic parties to actually engage the issue,” said Cathy Stewart, with the New York Independence Party.\n\n“Mm-hmm,” said Doocy.\n\n“Instead, they use it like a partisan football,” she continued.\n\n“Sure,” said Doocy. And, moving on: “John, real quick.”\n\nBut John Opdyke continued the previous independent voters' line of thought.\n\n“There’s a humanitarian crisis taking place in Central America, and yet this issue gets turned into a complete political football,” he said. “There’s very little honest discussion about what’s actually happening.”\n\n“And Aaron?” Doocy said. His voice had fallen to something like a raspy whisper.\n\n“Treating this as an ‘invasion’ is a bad idea, and it’s going to end horribly if it is treated such as that way,” said Aaron Commey, a libertarian and the final independent voter on the panel.\n\nDoocy collected his notes and sat up on his stool.\n\n“Sure, but the backdrop is the midterms, so it all becomes political,” he told the voters. “So let’s see what happens!”\n\nAnd with that, Fox & Friends dispensed with Monday’s migrant news alert and moved on to the subject of Democratic Sen. Elizabeth Warren’s DNA.\n\nThe next episode airs Tuesday morning. Perhaps another Fox News alert will pop up then, too.\n\nRead more:\n\nNavigating the border: The barriers that define the U.S.-Mexico borderline", "link": "https://www.washingtonpost.com/politics/2018/10/22/fox-friends-voter-panel-rebels-when-asked-about-migrant-caravan/?utm_term=.0c9b51e623e6", "published": "2018-10-22T00:00:00"}]}, "cnn_politics": {"link": "https://www.cnn.com/politics", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Bill Nelson": {"link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "articles": [{"title": "Hear new episodes of the true-crime podcast Felonious Florida now", "text": "A stunning triple murder, a killer clown and mysterious text messages from a missing woman.\n\nThe hit podcast Felonious Florida is back with a second season featuring three new stories from the Dark Side of the Sunshine State.\n\nIn Episodes 1 and 2, investigative reporter Stephen Hobbs follows the case of a brutal 2009 triple murder.\n\nThe sole survivor had been shot in the head, and her inconsistent memories of the ordeal were making it difficult for detectives to find a suspect. The case ended in a stunning courtroom drama, and Hobbs investigated what happened.\n\nLISTEN TO THE NEW EPISODES HERE\n\n“The state of Florida is rich with captivating stories,” said Julie Anderson, editor-in-chief of the South Florida Sun Sentinel. “The Sun Sentinel’s archives are filled with high-profile crime stories and we are pleased to be bring a second season of compelling stories to listeners with fresh and new information.”\n\nThe seven-part season also includes “The Disappearance of Lisa Spence,” in which text messages from the phone of a woman who had vanished led police to the discovery of her violent end. And “The Killer Clown,” a story of one of Florida’s most sensational murders that revealed some of the darkest parts of the state.\n\nHosted by EmmaKate Austin, Felonious Florida is produced by the South Florida Sun Sentinel in partnership with Wondery.\n\nSeason 1, which launched on April 3, 2018, reached the No. 1 spot on Apple Podcasts and in June was named the best new true-crime podcast of the year by The AV Club.", "link": "https://www.sun-sentinel.com/news/florida/fl-fea-felonious-florida-season-2-premiere-20181001-story.html#nt=notification", "published": "2018-10-01T00:00:00"}, {"title": "CNN Florida poll has good news for Andrew Gillum and Bill Nelson – maybe too good", "text": "Andrew Gillum is way ahead and Bill Nelson is leading in the latest big-name poll of Florida voters.\n\nBut the CNN poll doesn’t mean Democrats should celebrate or Republicans despair. The numbers may not be as good as advertised for Democrats Gillum and Nelson or as bad for Republicans Ron DeSantis or Rick Scott.\n\nIn the governor’s race, the CNN poll conducted Tuesday through Saturday shows Gillum with support from 54 percent of likely voters to 42 percent for DeSantis. That’s a 12 percentage point advantage for Gillum.\n\nIn the U.S. Senate race, CNN has Nelson leading Scott among likely voters, 50 percent to 45 percent. That’s a Nelson lead of 5 points.\n\nCNN has the famous brand name, but its poll might be overstating support for the Democratic candidates and understating support for the Republicans.\n\nAnother survey, from SEA Polling & Strategic Design, which generally polls for Democrats, found closer contests.\n\nIn the governor’s race, SEA found 48 percent for Gillum to 42 percent for DeSantis among registered voters.\n\nIn the Senate race, SEA found Scott leading Nelson, 47 percent to 45 percent among registered voters.\n\nThe poll from SEA was conducted from Wednesday through Saturday.\n\nGillum, the Democratic candidate for governor, is currently the mayor of Tallahassee. Republican DeSantis was serving his third term as a member of Congress from northeast Florida until he resigned last month to campaign full time.\n\nThe candidates met for their first debate Sunday night.\n\nDemocrat Nelson is seeking a fourth term in the U.S. Senate. Republican Gov. Rick Scott can’t run for a third term as governor because of term limits, so he is running against Nelson.\n\nBolstering the CNN numbers was a Quinnipiac University Poll of the Senate race released on Monday. The poll found Nelson with 52 percent support among likely voters to 46 percent for Scott.\n\nQuinnipiac hasn’t released results in the governor’s race.\n\nAmong the reasons to be cautious about the CNN numbers:\n\n-- Trump response — The CNN survey found more Florida voters disapprove (50 percent) than approve (42 percent) of President Donald Trump’s performance, a net negative of 8 percentage points.\n\nThat’s not unusual. Virtually every public opinion poll shows more disapproval than approval for the president.\n\nWhat is unusual is the comparison to the national average. RealClearPolitics reports the average of national polls shows 52 percent disapproval and 44 percent approval of Trump, a net negative of 8 points.\n\nThat’s strikingly similar to the percentages CNN reported in Florida. Throughout his presidency, Trump has had notably higher favorable percentages and lower unfavorable percentages in Florida than the nation.\n\nThe Quinnipiac Poll reported Trump’s approval at 46 percent positive to 51 percent negative.\n\n-- Hurricane Michael — The disruptions in electricity and phone service caused by the hurricane in the Panhandle – strong Republican territory — might change the composition of the people polled. It’s impossible to know how many Panhandle voters won’t participate in this year’s election.\n\n-- Methodology. The CNN survey asked people to describe their affiliations, with 32 percent Democrats, 29 percent Republican, and 39 percent independent.\n\nThe DeSantis campaign said the methodology of the poll is seriously flawed, which “renders the finding useless.”\n\nThe campaign said the sample “has more Independent voters than Democrats or Republicans and more Democrats than Republicans. However, in the 2010, 2012, 2014 and 2016 general elections more Republicans voted than Democrats or Independents.”\n\nStephen Lawson, a DeSantis spokesman, said in a written statement that the poll shows “why so many Americans believe that CNN peddles fake news.”\n\nCNN said its mix of Democrats, Republicans and voters who have no party affiliation or are members of a third party “almost exactly matches” the state’s registered voters.\n\n-- Outlier. Some polls are considered “outliers” by political professionals, meaning that for a variety of reasons they don’t get a good sample and the conclusions raise skepticism. Some political analysts have suggested the CNN poll might be an outlier.\n\nUntil the CNN poll released Sunday, the RealClearPolitics polling average had Gillum and DeSantis just 1 percentage point apart, with 45.3 percent for Gillum and 44.3 percent for DeSantis. Without CNN, the RealClearPolitics average in the Senate race had Scott and Nelson tied at 46.3 percent.\n\nIt’s possible that there’s been a big recent surge toward Gillum and Nelson, or the CNN poll could be an outlier.\n\nThe cable network acknowledged those possibilities in an article it published Monday about the poll. “The CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.”\n\nThe fine print\n\nIn the CNN poll, the research company SSRS used live callers to reach 759 likely voters by phone from Tuesday through Saturday. For likely voters, the pollster said the margin of error was plus or minus 4 percentage points.\n\nSEA said it used live callers to reach 600 registered voters and said its margin of error was plus or minus 4 percentage points.\n\nQuinnipiac surveyed 1,161 likely voters from Wednesday through Sunday using live callers. It reported a margin of error of plus or minus 4 percentage points.\n\naman@sunsentinel.com, 954-356-4550 or Twitter @browardpolitics", "link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "published": "2018-10-22T00:00:00"}, {"title": "CNN Poll: Democrats up in Florida with two weeks to go", "text": "WASHINGTON (CNN) As the final two weeks of campaigning begin, Democrats hold an edge in both the gubernatorial and Senate contests in the key state of Florida, according to a new CNN Poll conducted by SSRS. Democratic nominee Andrew Gillum holds a wide 12-point edge over his Republican opponent Rep. Ron DeSantis in the race for governor, while the Senate contest is a closer matchup with incumbent Democratic Sen. Bill Nelson at 50% to Republican Gov. Rick Scott's 45%.\n\nGillum's 54% to 42% lead rests on advantages among women (60% back him vs. 34% who say they favor DeSantis), non-white voters (74% back Gillum, 23% DeSantis), younger voters (60% for Gillum, 33% for DeSantis) and political independents (51% back Gillum, 42% DeSantis). Gillum has also consolidated Democratic support (97% favor him) in a way that DeSantis has not matched on the Republican side (88% back him).\n\nViews of Donald Trump are about as polarizing as partisanship in this race, which Trump has tweeted about multiple times. Among the 51% of likely voters who disapprove of the president, 92% back Gillum, while 87% back DeSantis among the 43% who approve of Trump.\n\nThe poll shows a wider lead for Gillum than some other recent telephone polling, nearly all of which was conducted before Hurricane Michael struck the state on October 10. Before the storm, public polling in mid- to late-September on these contests was mixed, with some (including surveys from Mason-Dixon and the University of North Florida) finding near-even races while others (including the Quinnipiac University and NBC News/Marist polls) gave the Democratic candidates the edge.\n\nThe CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.\n\nRead More", "link": "https://www.cnn.com/2018/10/21/politics/cnn-poll-florida-senate-governor/index.html", "published": "2018-10-21T00:00:00"}]}, "cnn_Rick Scott": {"link": "https://www.cnn.com/2018/04/09/politics/rick-scott-bill-nelson-florida/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Dean Heller": {"link": "https://www.cnn.com/2017/07/19/politics/dean-heller-trump/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Jacky Rosen": {"link": "https://www.cnn.com/2018/10/06/politics/womens-vote-key-states/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Claire McCaskill": {"link": "https://www.cnn.com/2018/09/22/politics/islam-claire-mccaskill-radio-ad/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Josh Hawley": {"link": "https://www.cnn.com/2018/10/01/politics/cnn-polls-missouri-nevada-senate/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}}}