{"newspapers": {"foxnews_politics": {"link": "http://www.foxnews.com/politics", "articles": []}, "cnbc_politics": {"link": "https://www.cnbc.com/politics/", "articles": [{"title": "Obamacare could expand after midterms, despite GOP efforts to kill it", "text": "Don't look now, but America's first Trump-era midterm election could substantially expand Obamacare.\n\nThat's right, expand Obamacare – implausible as it sounds after the all-GOP government's near miss on repealing the program and attempts to undermine it. Polls show Democratic calls for improved health insurance continue to resonate with big chunks of the electorate, and may yield Election Day gains.\n\nSpecifically, November balloting could bring half the 18 states that have resisted expanding Medicaid, a key feature of the Affordable Care Act, closer to taking that step. If they do, more than 1 million low-income Americans could gain Medicaid coverage.\n\n\"I don't think people have put it together,\" observed Andy Slavitt, a former top Obama health aide. \"Election Day is the biggest referendum on the ACA. These votes will also be a referendum on Trump policies, which have done everything they can to limit Medicaid and access to care.\"\n\nThe greatest potential impact lies in two of the three largest states that so far have refused to expand Medicaid despite generous Obamacare subsidies. Democrats Andrew Gillum in Florida and Stacey Abrams in Georgia both back expansion in their competitive campaigns to succeed outgoing Republican governors.\n\nThe same dynamic applies in smaller states. In Wisconsin, anti-expansion GOP Gov. Scott Walker trails pro-expansion Democratic rival Tony Evers in his bid for a third term. In Kansas, Maine and South Dakota, pro-expansion Democrats battle anti-expansion Republicans in toss-up gubernatorial races.\n\nAt the same time, voters will decide Medicaid expansion for themselves through ballot initiatives in Idaho, Nebraska and Utah. Polls show strong prospects for all three measures, and GOP governors have pledged not to obstruct voters' wishes.\n\nThirty-two states and the District of Columbia have already expanded, providing Medicaid benefits to more than 10 million low-income Americans, according to the Kaiser Family Foundation. Another 3.7 million stand to gain Medicaid coverage if remaining holdout states follow suit.\n\n\"The battleground for Medicaid expansion is in the red states,\" noted Kaiser health policy expert Diane Rowland. For proponents, the persistent refusal of some GOP leaders makes ballot measures a critical tool.\n\nThose aren't automatic. Maine's outgoing Republican governor, Paul LePage, has blocked Medicaid expansion even after his constituents approved it last year.\n\nNor does election of a pro-expansion governor ensure that it happens. In North Carolina, the fourth-largest state that hasn't expanded, Democratic Gov. Roy Cooper has been stymied on the issue by Republican legislators since his 2016 election.\n\nIn the state, opponents of expansion say the government can't afford it. In Washington, GOP leaders insist Congress must curb the major entitlement programs of Medicaid, Medicare and Social Security to avoid long-term insolvency.\n\nYet political winds have shifted in the wake of Republican attempts to end Obamacare. In a Kaiser poll this summer, Americans rated the law favorably by 50 percent to 40 percent, after it had remained below 50 percent through Obama's last six years in office.\n\nBoth Trump and GOP candidates, under fire over their efforts to eliminate guaranteed, affordable coverage for people with pre-existing conditions, now claim to support that guarantee. In the latest NBC News/Wall Street Journal poll, voters preferred Democrats over Republicans on health care by 18 percentage points.\n\nDemocrats have placed the issue at the center of their campaign advertising, to productive effect. In the NBC/WSJ survey, voters ranked health care second behind the economy and jobs as an influence on their votes for Congress; those citing health care back Democrats over Republicans by 69 percent to 22 percent.\n\nIn the states the 2018 election has put in play, poor communities across the country stand to gain Medicaid coverage in big chunks: 662,000 in Florida; 388,000 in Georgia; 77,000 in Utah; 74,000 in Kansas; 70,000 in Maine; 41,000 in Idaho; 32,000 in Wisconsin; 31,000 in Nebraska, Kaiser estimates.\n\n\"These initiatives are an uprising by the public in state after state against politicians who put their ideology over the health-care needs of their constituents,\" argued Neera Tanden, another former Obama health adviser. \"The public wants people covered.\"", "link": "https://www.cnbc.com/2018/10/23/obamacare-could-expand-after-midterms-despite-gop-efforts-to-kill-it.html", "published": "2018-10-23T00:00:00"}, {"title": "Amazon CEO Jeff Bezos backs Sen. Cory Gardner for re-election", "text": "Several high-level Amazon executives including CEO Jeff Bezos pumped cash into Republican Sen. Cory Gardner's campaign committee, a new third-quarter Federal Election Commission filing revealed. But the money isn't to help the senator from Colorado in the Nov. 6 midterms. Gardner isn't up for re-election until 2020.\n\nBezos and his wife, MacKenzie, each wrote checks worth $5,400 to Gardner's campaign committee; that amount is the most an individual is allowed to give to those seeking public office.\n\nBezos was joined by eight other Amazon representatives, including Jeffrey Wilkie, the CEO of Amazon's Worldwide Consumer division, and Brian Olsavsky, the company's chief financial officer, who each gave $5,400. All of the contributions from the Amazon executives came in September.\n\nAmazon spokeswoman Jill Kerr confirmed Bezos' contribution to Gardner but declined to comment further. A representative for Gardner did not return a request for comment.\n\nWhile it's unclear why some leaders at the online retailer decided to back Gardner, Amazon has lobbied for numerous pieces of legislation that the Colorado Republican has co-sponsored. The DIGIT Act, which recently passed the U.S. Senate and is expected to be voted on in the House of Representatives, is one of four Gardner co-sponsored bills that Amazon's government relations team supported.\n\nThe bill, introduced by Republican Sen. Deb Fischer of Nebraska, calls on the Commerce Department to create a working group to examine what's described as the \"Internet of Things,\" a network of devices that are connected by the internet and have the ability to exchange data.\n\nA second-quarter lobbying disclosure form shows Amazon spent over $3 million on issues pertaining to that bill and other pieces of legislation at the time.\n\nGardner's state has also seen a boost from Amazon's goal of expanding its operations. In 2017, Amazon opened a fulfillment center in Aurora, Colorado. In September of that year, it was reported that the company hired over 900 people to work in the new location. Gardner, at the time, celebrated the grand opening in a tweet.\n\nIn October 2017, Gardner, along with other members of Colorado's congressional delegation, signed a letter to Bezos supporting the decision to make their state a candidate for Amazon's HQ2 project. The retail company is looking to create a new corporate headquarters in a city other than its home base of Seattle. In January, Denver was on the list of potential cities for the new headquarters. Amazon's CEO has said he will make a final decision on the host city by the end of the year.\n\nGardner, the chairman of the National Republican Senatorial Committee, which helps Republicans get elected into the Senate, is one of the top beneficiaries of Amazon's campaign donations in the 2018 election cycle even though he's not running, according to the nonpartisan Center for Responsive Politics. The two candidates above him on that list are Democratic Rep. Beto O'Rourke, who is looking to unseat Republican Sen. Ted Cruz of Texas this cycle, and Democratic Washington Sen. Maria Cantwell, who is seeking re-election in November.\n\nAmazon and Bezos have become some of the top spenders throughout the 2018 midterm season.\n\nBezos, considered the wealthiest man in the world by Forbes with a net worth of $144 billion, gave just over $10 million back in August to the With Honor Fund, a bipartisan super PAC looking to elect veterans into the House this year.\n\nAmazon employees and affiliated political action committees spent $12.6 million on this year's midterms, according to data from the Center for Responsive Politics. It's the most that company executives have invested in an election since 2016, when only $1 million was put forward.", "link": "https://www.cnbc.com/2018/10/23/amazon-ceo-jeff-bezos-backs-senator-cory-gardner-for-re-election---in-2020.html", "published": "2018-10-23T00:00:00"}, {"title": "If Democrats lose these House races, it won't be for lack of cash", "text": "Campaign contributions can provide a look into both voter enthusiasm and a campaign's ability to get its message out in the final days of a race. As in the past, much of the money is coming from out of state.\n\nStill, \"having more money is not always predictive of success,\" according to Kyle Kondik, managing editor of nonpartisan election analysis site Sabato's Crystal Ball.\n\n\"This year, a lot of those challengers are outraising the incumbents,\" Kondik said in an email. \"It's hard to quantify how much the money matters but many Democrats are going to have the resources to get their message out in the closing days.\"\n\nAs Democrats try to flip a net 23 GOP-held seats and take a majority, most of the key battles this year will take place in districts held by Republicans. In those races, a money advantage will not necessarily lead to more votes for Democratic candidates.\n\nCook shows 17 districts of those potential flips leaning toward Democrats. They out-raised their GOP rivals and also hold a cash advantage in 13 of those races.", "link": "https://www.cnbc.com/2018/10/23/democrats-raise-big-money-as-they-try-to-win-midterm-house-elections.html", "published": "2018-10-23T00:00:00"}, {"title": "'Don't mess with American elections': Trump national security advisor John Bolton tells Russia", "text": "President Donald Trump's national security advisor, John Bolton, told reporters Tuesday in Moscow that the Russian effort to interfere in America's elections is \"objectionable\" and made it \"impossible for two years\" for the United States and Russia to make progress diplomatically.\n\n\"That's a loss, particularly for Russia,\" said Bolton, after a 90-minute meeting with Russian President Vladimir Putin.\n\n\"So it's a lesson I think, don't mess with American elections,\" Bolton said.\n\n\"What the meddling did create was distrust and animosity in the U.S. and made it almost impossible for two years for Russia and the U.S. to make progress diplomatically,\" Bolton said.\n\nHe noted that during his sit-down with Putin, \"we discussed our continuing concern with Russian meddling in the election.\"\n\nThat interference, which included hacking of Democratic National Committee computers and efforts to sow discord online by using bogus social media accounts, has led to the Trump administration issuing sanctions against dozens of Russian individuals and entities.\n\nBut Bolton also said, \"taken what we've seen so far, there's no possibility the outcome of the [2016 presidential election] would've been changed.\"\n\nHe was referring to federal indictments accusing Russian individuals and entities with American election interference, including in the election that sent Trump to the White House.\n\n\"The fact is, the outcome would've been exactly the same with all the evidence we have,\" Bolton said.\n\n\"If new information comes to light, we would have to take that into account.\"\n\nTrump, after a meeting with Putin in Helsinki in July, had suggested to reporters that he was inclined to believe Putin's denials that Russia had tried to influence the outcome of the presidential election.\n\n\"I will say this: I don't see any reason why it would be\" Russia, Trump said at the time.\n\nEx-CIA Director John Brennan, a Trump critic, called the president's performance at that news conference \"nothing short of treasonous.\" The late Sen. John McCain, R-Ariz., accused Trump of conducting \"one of the most disgraceful performances by an American president in memory.\"\n\nThe U.S. Cyber Command, a division of the Defense Department, has started to contact individual Russians in an effort to deter them from interfering with the upcoming midterm elections in the United States, according to a New York Times report Tuesday.\n\nBut Bolton suggested Tuesday that the Russian effort to interfere in elections pales in comparison to an alleged ongoing effort by China to meddle in U.S. domestic affairs.\n\n\"If you want to talk about a really massive influence effort on the American political system, I suggest you read Vice President [Mike] Pence's speech on China's efforts ... looking at everything China was doing,\" Bolton said.\n\n\"Very, very senior US intelligence officials said it makes Russia look like the junior varsity.\"\n\nPence, in a speech in early October, had said, \"To put it bluntly, President Trump's leadership is working; and China wants a different American President.\"\n\nPence's claims came days after Trump, in a speech at the United Nations' Security Council, said China was trying to interfere in November's midterm elections.\n\nThey don't want me, or us, to win because I am the first president to ever challenge China on trade,\" Trump said.\n\nChina's Foreign Ministry strongly denied the claims by Trump and Pence.", "link": "https://www.cnbc.com/2018/10/23/john-bolton-says-russia-meddling-in-american-election-harmed-diplomacy.html", "published": "2018-10-23T00:00:00"}]}, "washingtonpost_politics": {"link": "https://www.washingtonpost.com/politics/", "articles": [{"title": "So many people are buying Mega Millions tickets that unique number combinations are running out", "text": "Just stop somewhere — a coffee shop, the grocery store checkout, or your office — and listen.\n\nOdds are, someone within earshot is hatching a plan to buy mansions and yachts as long as a city block. But of course, many are sure to explain, they will divert serious cash to charity after winning what lottery officials call the biggest lottery jackpot in history.\n\nTuesday’s Mega Millions drawing will pay out at least $1.6 billion to winning jackpot ticket holders, if there are any, after Friday’s already record-setting drawing ended with no ticket matching all six numbers. That number is “uncharted territory” for Mega Millions, lottery officials said.\n\nThe jackpot will increase to $2 billion for Friday’s drawing, Gentry said, if there are no winners.\n\nBut the chances are rising that a winner or winners will emerge after the numbers are called.\n\nBy then, lottery officials estimate 75 percent of all number combinations will be purchased, Maryland Lottery and Gaming spokeswoman Carole Gentry told The Washington Post. With more than 300 million possible combinations, the odds of winning are 1 in 302,575,350.\n\nMore than one set of winning numbers can be bought, though that would mean two or more people would have to share the massive payout.\n\nThe fever has struck nationwide.\n\nOn Thursday, ahead of the last drawing, in California players were buying 200 tickets a second, the Associated Press reported.\n\nBack on the east coast on Friday, about 9,100 tickets were purchased a minute in Maryland in a two hour window ahead of the drawing, state lottery officials said.\n\nThe Virginia Lottery projects sales after Friday’s drawing through Tuesday’s drawing will approach $19 million, lottery spokeswoman Jennifer Mullen said. In the sales peak, as many as 12,700 tickets will be sold per minute, Mullen said.\n\nThe deadline for buying tickets in most states is 10:45 p.m. EST, or 15 minutes ahead of the drawing, though some stop sales earlier.\n\nWhat’s my payout if I win?\n\nThe estimated cash option is about $905 million should a winner choose to take a one-time lump sum payment instead of annual payouts over 30 years, according to Mega Millions officials.\n\nBut that’s before taxes. You’d get about half of that after state and federal taxes take a big bite of your winnings, the AP reported. The annual payouts would net a higher payout over time, but you would have to squirrel away enough money to buy, say, a struggling NFL team.\n\nAnd if you take the annual payouts rather than the lump sum, you may even be an eventual billionaire. The website USAMega.com breaks down what your winnings could look like after taxes for your state. Even highly taxed states like New York show figures cresting a billion dollars after 30 years of payments.\n\n[You’ve won the Mega Millions jackpot! Time to hide.]\n\nIs it me, or are lottery jackpots huge these days?\n\nIt’s not just you. Lottery officials count on enormous jackpots to draw in players who would ordinarily avoid participating, so last October they made two big changes. They doubled ticket prices to $2 — and tweaked the formula to make it easier to win smaller prizes but harder to win the jackpot.\n\nHere’s how Mega Millions used to work: Players picked five numbers from 1 to 75 and a Mega number from 1 to 15. The odds of winning the top prize were 1 in 258,890,850.\n\nSince Mega Millions modified the formula, players now pick five numbers from 1 to 70 and a Mega number of 1 to 25. The odds of winning the jackpot are now 1 in 302,575,350.\n\nIn other words, reducing the number of balls for the first five numbers increases the chances of winning a smaller prize. But raising the number of Mega Balls makes it harder to win the jackpot. (You still win the big jackpot by matching all six winning numbers in a drawing.)\n\nPowerball made similar changes to its rules in 2015. That game itself is currently at a monster jackpot, though a small one relative to Mega Millions, at $620 million ahead of Wednesday’s drawing.\n\nDo people think they’re going to win?\n\nThey do.\n\n“I believe I already won,” Joseph Rauch told Reuters, “believe I believe in the law of attraction. So what’s meant to be is already gonna be.”\n\nOthers are already self-read experts on how to deal with such an enormous and public prize. “I would incorporate myself as a business and become my own company,” Gregory Baron said in New York City.\n\nAnd even apparent fatalists are wandering to the corner store for a shot at the jackpot.\n\nHank Kattan is 75 years old. He does not expect to win at all. And yet.\n\n“I’ll never win, but you gotta give it a shot,” he told Reuters. “I’d like to change my way of life.”\n\nAmy B Wang and J. Freedom du Lac contributed to this report.\n\nRead more:\n\nHe returned the orange juice to save money — and picked up a winning $315 million lottery ticket\n\nWinner of a $560 million Powerball jackpot can keep the money and her secret, judge rules\n\nPerspective | How ’80s excess fueled today’s Mega Millions mania\n\nShe bought her first lottery ticket on her 18th birthday — and now she’s set for life", "link": "https://www.washingtonpost.com/business/2018/10/23/so-many-people-are-buying-mega-millions-tickets-that-number-combinations-are-running-out/", "published": "2018-10-23T00:00:00"}, {"title": "You’ve won the Mega Millions jackpot! Time to hide.", "text": "First things first: Quadruple-check your ticket after Tuesday’s Mega Millions drawing. Then do it again.\n\nDo they match the winning numbers?\n\nNo? Skip to here. Or here.\n\nYes? Lock the deadbolt and read on.\n\nCongratulations!\n\nSo, you’ve done it. Beaten the odds — one in 302,575,350 — and won the largest Mega Millions jackpot in U.S. lottery history. Perhaps you’re splitting the $1.6 billion grand prize with another winning ticket or two. Either way, you’re almost certainly about to enjoy an astronomical spike in wealth.\n\nNow what?\n\nBefore you shout from the rooftops or broadcast your excitement on social media, take a deep breath and keep some practical advice in mind.\n\nTo sign or not to sign the back of the lottery ticket?\n\nThere are plenty of people who will advise you to sign the back of the lottery ticket right away. After all, what would happen if, heaven forbid, you lost the ticket? Or worse yet, if an unscrupulous person in your life took the unsigned ticket and claimed it as his or hers?\n\nNot so fast.\n\nA handful of states allow lottery winners to remain anonymous, while others require them to be publicly identified — though it’s possible winners in those states could still remain anonymous if they claim the prize through a trust or a limited liability company (more on that later). However, signing the back of the lottery ticket with your real name may bind you to claiming the prize under that name, thus releasing your identity to the public even if that’s not what you want.\n\n[He returned the orange juice to save money — and picked up a winning $315 million lottery ticket]\n\nEarlier this year, a New Hampshire woman who won a $560 million Powerball jackpot found herself in just such a predicament: She wanted to claim the prize under an anonymous trust but had already signed the back of her ticket with her real name.\n\nA judge eventually ruled she could keep the money and her privacy but, as The Washington Post’s Cleve R. Wootson Jr. reported, she lost about $14,000 in interest every day the case remained unresolved.\n\nWhat may be more advisable is keeping the ticket in a secure place, such as a safe, while you consult with an attorney.\n\nThat way, if you decide to create a trust or an LLC through which to claim your prize, you can sign the back of the ticket with the name of those entities instead.\n\nSpeaking of attorneys ...\n\n“The three phone calls I would make: lawyer, accountant, financial adviser,” said Randy Zelin, a New York-based litigation attorney.\n\nA lawyer who specializes in trusts and estate planning would be ideal, but the most important thing to remember is that your privacy is paramount, Zelin said this week.\n\nA few years ago, Zelin cringed as he watched another attorney parade his clients — a Tennessee family that had won a $500 million Powerball jackpot — onto the “Today” show to announce their winnings.\n\n“That goes down in the annals of 'What exactly were you thinking?’” Zelin told CNN at the time.\n\n[So many people are buying Mega Millions tickets that number combinations are running out]\n\nAn attorney can help you navigate what you are obligated to divulge under the terms and conditions of your ticket and your state’s public disclosure laws.\n\n“You want to discuss everything from the vehicle that you’re going to use for the money to go to, how to handle the publicity, understanding what your rights are and your obligations are in terms of making yourself available and the use of your likeness,” Zelin told The Post.\n\nThese may seem like unnecessary precautions now, but lottery winners are famously susceptible to becoming targets for everything from extortion to blackmail to even kidnapping.\n\nThere will certainly be people who approach you for handouts if your name is public.\n\n“You don’t need every family member you never heard of coming out of the woodwork,” Zelin said. “You want to be as low-key and have this money lawyered and away from prying eyes as you possibly can. Just about the last thing you want to do is be public when you win.”\n\nFind a good accountant and financial adviser, too\n\nMega Millions allows jackpot winners to claim the grand prize either through a onetime lump-sum cash payment or through annual payments over 30 years. In the case of Tuesday’s big prize, the lump-sum cash option will be an estimated $905 million, while the annuity payments would, eventually, amount to $1.6 billion.\n\nA reliable accountant can ensure you understand the tax consequences in your state for both options. The website USAMega.com breaks down what your winnings could look like after taxes for your state.\n\n[She bought her first lottery ticket on her 18th birthday — and now she’s set for life]\n\nThe benefit of the smaller lump sum, of course, is that you get more money right away. That can also be a drawback for people who are not used to wealth.\n\n“There’s nothing inherently different about lottery winnings than it is about other kinds of wealth that’s created,” said Michael S. Arlein, a trust and estate planning lawyer. “But I think often lottery winners don’t come from money, and so they instantaneously have to deal with money. One day they have none, and the next day they have a huge amount. So I think there’s probably a learning curve that exists for lottery winners that doesn’t exist for people who made their money over a longer period of time.”\n\nAfter you’ve decided whether you want to take the lump sum, a financial adviser can help ensure it’s managed and invested wisely.\n\nAs The Post has reported, there are countless stories of people whose lottery winnings have vanished almost as quickly as they won it.\n\nOther lottery winners have realized that every ticket buyer’s fantasy can quickly morph into a nightmare. There are myriad self-inflicted problems that can befall a person who suddenly comes into great wealth. One bought a water park, for example. Several others have gambled their winnings away, including a two-time lottery winner who ended up living in a trailer. Billie Bob Harrell Jr., who won $31 million in 1997, told his financial adviser shortly before his suicide that “winning the lottery is the worst thing that ever happened to me.”\n\n“How many stories have we heard?” Zelin said. “You’re now a piñata if you allow yourself to be. You really need to be very smart.”\n\nThe number one thing to try to hold onto is patience.\n\nMega Millions winners have between 180 days to one year from the date of the drawing to claim their prize, depending on the state in which the winning tickets were purchased.\n\nThat should allow ample time to hire a lawyer, create a trust if necessary and prepare, prepare, prepare.\n\n“You don’t want to do anything too quickly. You have time,” Zelin said. “There’s no need to make any sudden moves, and you want to be very smart about the way you handle it because things happen at about 400 miles an hour and you want to be prepared for it. There’s no substitute for preparation.”\n\nRead more:\n\nA hospital worker won the Powerball. Her prize: $758.7 million — and police outside her house.\n\nSo many people are buying Mega Millions tickets that number combinations are running out\n\nHow Mega Millions changed the odds to create a record-breaking $1.6 billion jackpot\n\nPer capita lottery spending has doubled since 1995", "link": "https://www.washingtonpost.com/business/2018/10/23/youve-won-mega-millions-jackpot-time-hide/", "published": "2018-10-23T00:00:00"}, {"title": "Utah refused to prosecute four sexual assault cases, so the alleged victims set out to do it themselves", "text": "One petitioner was a 17-year-old high school senior when she alleged that a classmate had raped her. Another claimed her co-worker had assaulted her. The third petitioner accused a police chief of raping her several times while she was volunteering in his department. And the fourth, now 30, said she was assaulted by a massage therapist.\n\nAll four cases were reviewed by the local prosecutor’s office, which declined to file charges.\n\nNow the four Utah residents are using a novel approach to make their voices heard: a provision in the state’s constitution that permits alleged crime victims to request that the state Supreme Court appoint a prosecutor if a district attorney refuses a case.\n\nThe constitutional clause is unique to Utah, but the concept of victim-initiated prosecution is available in other states.\n\nAttorneys for the women are optimistic that if they succeed in Salt Lake County, the ruling will create a viable blueprint for other states.\n\nSalt Lake County District Attorney Sim Gill called the petition an “intriguing thing that’s never been challenged.” Still, Gill joins a number of lawyers who worry that a successful lawsuit will pave the way for thousands of frivolous petitions in many types of cases.\n\nIn the past two years, all four women — known in their recently filed lawsuit as “the Jane Does” — said they were attacked by someone they knew and reported the assault within days.\n\nJane Doe 1, now 18, told The Washington Post that she hopes to help other victims be heard.\n\nAfter the Salt Lake County District Attorney’s Office declined to prosecute the case, the teenager’s high school allowed her alleged rapist back on campus.\n\n“It made me feel so vulnerable and scared,” she said. “We think the law will protect those who have been wronged. I don’t want another girl going through this again. I want to make it easier to get help and to have the law believe you.”\n\nThe lawsuit is the first time in Utah’s 120-year history that anyone has approached the issue this way, Paul Cassell, a former federal judge and professor at the University of Utah’s S.J. Quinney College of Law, told The Post.\n\nHistorically, the nation rarely questions a law enforcement decision to decline bringing charges. “The sexual assault under-prosecution problem is forcing people to reevaluate that,” he said.\n\nInstead of requesting sweeping interference with law enforcement decisions, the lawsuit asks for a specific ruling on a case that has been turned down for prosecution.\n\n[Police in many states could legally have sex with a person in custody — until a N.Y. rape allegation]\n\nThe suit comes amid heated national dialogue about sexual abuse, as the #MeToo movement has emboldened more women to speak out. It was further fueled by the confirmation hearings of Supreme Court Justice Brett M. Kavanaugh, which were shadowed by outrage over decades-old allegations of sexual assault.\n\nThe consensus, according to attorney Bethany Warr, who represents three of the Jane Does, is that sexual assault cases are under-prosecuted, though there are places where it’s more pronounced than others.\n\n“They have a tendency to be declined by district attorneys, and fairly so — they’re difficult cases,” Warr said. The lawsuit aims to further the dialogue about why juries are so hard on sex-crime victims and why society has such a hard time believing them, she said.\n\nSex-crime prosecutions are widely accepted as some of the most challenging in the criminal justice system.\n\nSexual assaults rarely happen with other witnesses present, and anything that deviates from the cliche of a masked, armed man committing a rape in an alleyway adds a variable that must be explained to frequently judgmental juries.\n\nIn Salt Lake County, Cassell said, assistant district attorneys operate under outdated notions of what cases are winnable, saying that prosecutors who are fearful of losing are the real barrier to successful prosecutions.\n\nGill, who is up for reelection this year, agreed that these are difficult cases for prosecutors. But, he said, that doesn’t mean his office refuses to prosecute them.\n\nAn average of 44 percent of violent crimes are reported to law enforcement and result in arrest, according to a statement released by Gill on Tuesday. Sexual crimes, he said, vary dramatically.\n\nIn Utah, 12 percent are brought forward — meaning 88 of 100 people fail to report sexual assault claims, Gill told The Post. He also said that last year, his office filed charges in 39 to 40 percent of 600 sexual assault reports, consistent with the national average.\n\nGill said there’s a social stigma associated with sexual assault, and because only a small percentage are reported, a systemic attrition happens.\n\n“We need to figure out what the balance is — to reassure victims that we see and hear them, while asking if the interests of justice will be met by bringing the case forward. Can we meet the legal burden in good faith?”\n\nGill pointed out that sexual assault cases have nuanced complexity. One major consideration, he said, is whether to re-traumatize a victim by having her testify in a case that would be challenging to win.\n\nDeborah Tuerkheimer, a professor at Northwestern University’s School of Law and a former prosecutor, said, “The problem with prosecutors is that they’re not just thinking about legal sufficiency, they’re thinking about convictability” — the likelihood that 12 jurors can be convinced beyond a reasonable doubt. “Often, jurors are unpersuaded because of biases and rape myths. When prosecutors take that into account in charging decisions, even anticipatorily, they’re embedding them into the system.”\n\nThe #MeToo movement heightened awareness of the prevalence of sexual assault. Part of the benefit is that people better understand what sexual violence looks like, which mitigates assumptions about the type of person who perpetrates these crimes and how a survivor “should” behave, Tuerkheimer said.\n\nThe petitioners remain hopeful that the Utah Supreme Court, which has the petition under advisement, will direct the attorney general’s office and other government agencies to file briefs in response.\n\nEach of the Jane Does wants to fight for the right to hold her alleged abuser accountable. Jane Doe 4 told the Salt Lake Tribune: “I did everything that I needed to do and I did it as strongly as I could,” she said. “I didn’t realize how disappointing and heartbreaking it would be.”\n\nBy putting their stories into circulation, they hope to challenge old injustices and forge change within the criminal justice system.\n\nRead more:\n\nFormer state GOP official warns Trump protesters: Montana is an ‘open carry state’\n\nA black child’s backpack brushed up against a woman. She called 911 to report a sexual assault.\n\nVideo shows woman leaving toddler on stranger’s doorstep in Texas and running away", "link": "https://www.washingtonpost.com/nation/2018/10/22/utah-refused-prosecute-their-sexual-assault-cases-so-four-women-set-out-do-it-themselves/?utm_term=.209c151f74d8", "published": "2018-10-22T00:00:00"}, {"title": "Three Miami officers accused of escorting cocaine traffickers for cash", "text": "\n\nFrom left, James Archibald, Schonton Harris and Kelvin Harris. (Miami Police Department)\n\nThree Miami police officers face federal drug charges after allegedly accepting cash in exchange for police protection in a cocaine and opioid distribution operation.\n\nA criminal complaint unsealed Tuesday alleged that a citizen complaint sparked a months-long FBI sting operation, culminating with the arrest of Officers Schonton Harris, Kelvin Harris and James Archibald. The officers were charged with conspiracy to possess cocaine with the intent to distribute, attempting to possess cocaine with intent to distribute and using a firearm during and in relation to a drug trafficking crime, which are federal felony offenses.\n\n“No one, not even a police officer, is above the law,” U.S. Attorney for the Southern District of Florida Ariana Fajardo Orshan, who took office last month, said at Tuesday’s news conference. That includes the officers now charged with the very crimes they had a duty to investigate, report and help prosecute, she said.\n\n“Sometimes we have bad seeds in law enforcement. Those officers who dishonor their badge and who endanger the public will be called to answer for the crimes they commit,” Orshan said.\n\nAccording to the complaint, Schonton Harris masterminded the scheme.\n\nIn a recorded conversation, she agreed to serve as a police escort for a drug courier who was “purportedly collecting drug proceeds from pharmacies and clinics engaging in the illegal sale of opioids and then driving to a bank to deposit the proceeds,” according to the complaint.\n\nThis happened several times between May and June. In July, the complaint alleges, Harris escorted what she believed to be a shipment of 2,000 opioid pills and several kilograms of cocaine through Miami.\n\nThe sting operation expanded the following month when she met with an undercover FBI agent who was posing as a high-ranking member of a drug trafficking organization, the complaint alleges.\n\nThen, Harris allegedly recruited the two other police officers.\n\n\n\nThe U.S. Attorney’s Office for the Southern District of Florida announces the arrest of three Miami police officers on federal drug charges. (Sarah Schall/USAFLS)\n\nThe trio collectively acted as security escorts for cocaine traffickers and money-laundering couriers in exchange for cash, on one occasion personally transporting 30 kilogram-size bricks of sham cocaine, according to the complaint. Schonton Harris, Kelvin Harris and Archibald allegedly received $17,000, $10,000 and $6,500 in bribes, respectively.\n\nThe complaint says Schonton Harris, who admitted to using and selling drugs while on the job and rigging police department drug testing, also sold a city of Miami police uniform and badge to an undercover FBI agent for $1,500, knowing it would be used by a hit man to kill an individual who stole drugs from the trafficker.\n\nLaw enforcement at the state and federal level worked together to bring the public corruption case to a close.\n\n“I hope these arrests serve as a warning,” said Miami Police Chief Jorge Colina, because officers who betray the badge will be held accountable. “There is no refuge for you here. If you are corrupt, we’ll find you and you will answer for your crimes. That is the commitment from the Miami Police Department to every resident of the city of Miami.”\n\nAccording to the Miami Herald, the trio are expected to appear in federal court on Wednesday. If convicted of the conspiracy and attempted narcotics possession with intent to distribute charges, the defendants each face life in prison and a mandatory-minimum sentence of 10 years in prison.\n\nRead more:\n\nWhen cops are suspects, feds often take years to file charges\n\nUtah refused to prosecute four sexual assault cases, so the alleged victims set out to do it themselves\n\nPolice say ex-boyfriend shot and killed University of Utah track and field athlete before killing himself", "link": "https://www.washingtonpost.com/nation/2018/10/23/three-miami-officers-accused-escorting-cocaine-traffickers-cash/?utm_term=.0406a3cdabfc", "published": "2018-10-23T00:00:00"}]}, "cnn_politics": {"link": "https://www.cnn.com/politics", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}, "cnn_Bill Nelson": {"link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "articles": [{"title": "Hear new episodes of the true-crime podcast Felonious Florida now", "text": "A stunning triple murder, a killer clown and mysterious text messages from a missing woman.\n\nThe hit podcast Felonious Florida is back with a second season featuring three new stories from the Dark Side of the Sunshine State.\n\nIn Episodes 1 and 2, investigative reporter Stephen Hobbs follows the case of a brutal 2009 triple murder.\n\nThe sole survivor had been shot in the head, and her inconsistent memories of the ordeal were making it difficult for detectives to find a suspect. The case ended in a stunning courtroom drama, and Hobbs investigated what happened.\n\nLISTEN TO THE NEW EPISODES HERE\n\n“The state of Florida is rich with captivating stories,” said Julie Anderson, editor-in-chief of the South Florida Sun Sentinel. “The Sun Sentinel’s archives are filled with high-profile crime stories and we are pleased to be bring a second season of compelling stories to listeners with fresh and new information.”\n\nThe seven-part season also includes “The Disappearance of Lisa Spence,” in which text messages from the phone of a woman who had vanished led police to the discovery of her violent end. And “The Killer Clown,” a story of one of Florida’s most sensational murders that revealed some of the darkest parts of the state.\n\nHosted by EmmaKate Austin, Felonious Florida is produced by the South Florida Sun Sentinel in partnership with Wondery.\n\nSeason 1, which launched on April 3, 2018, reached the No. 1 spot on Apple Podcasts and in June was named the best new true-crime podcast of the year by The AV Club.", "link": "https://www.sun-sentinel.com/news/florida/fl-fea-felonious-florida-season-2-premiere-20181001-story.html#nt=notification", "published": "2018-10-01T00:00:00"}, {"title": "CNN Florida poll has good news for Andrew Gillum and Bill Nelson – maybe too good", "text": "Andrew Gillum is way ahead and Bill Nelson is leading in the latest big-name poll of Florida voters.\n\nBut the CNN poll doesn’t mean Democrats should celebrate or Republicans despair. The numbers may not be as good as advertised for Democrats Gillum and Nelson or as bad for Republicans Ron DeSantis or Rick Scott.\n\nIn the governor’s race, the CNN poll conducted Tuesday through Saturday shows Gillum with support from 54 percent of likely voters to 42 percent for DeSantis. That’s a 12 percentage point advantage for Gillum.\n\nIn the U.S. Senate race, CNN has Nelson leading Scott among likely voters, 50 percent to 45 percent. That’s a Nelson lead of 5 points.\n\nCNN has the famous brand name, but its poll might be overstating support for the Democratic candidates and understating support for the Republicans.\n\nAnother survey, from SEA Polling & Strategic Design, which generally polls for Democrats, found closer contests.\n\nIn the governor’s race, SEA found 48 percent for Gillum to 42 percent for DeSantis among registered voters.\n\nIn the Senate race, SEA found Scott leading Nelson, 47 percent to 45 percent among registered voters.\n\nThe poll from SEA was conducted from Wednesday through Saturday.\n\nGillum, the Democratic candidate for governor, is currently the mayor of Tallahassee. Republican DeSantis was serving his third term as a member of Congress from northeast Florida until he resigned last month to campaign full time.\n\nThe candidates met for their first debate Sunday night.\n\nDemocrat Nelson is seeking a fourth term in the U.S. Senate. Republican Gov. Rick Scott can’t run for a third term as governor because of term limits, so he is running against Nelson.\n\nBolstering the CNN numbers was a Quinnipiac University Poll of the Senate race released on Monday. The poll found Nelson with 52 percent support among likely voters to 46 percent for Scott.\n\nQuinnipiac hasn’t released results in the governor’s race.\n\nAmong the reasons to be cautious about the CNN numbers:\n\n-- Trump response — The CNN survey found more Florida voters disapprove (50 percent) than approve (42 percent) of President Donald Trump’s performance, a net negative of 8 percentage points.\n\nThat’s not unusual. Virtually every public opinion poll shows more disapproval than approval for the president.\n\nWhat is unusual is the comparison to the national average. RealClearPolitics reports the average of national polls shows 52 percent disapproval and 44 percent approval of Trump, a net negative of 8 points.\n\nThat’s strikingly similar to the percentages CNN reported in Florida. Throughout his presidency, Trump has had notably higher favorable percentages and lower unfavorable percentages in Florida than the nation.\n\nThe Quinnipiac Poll reported Trump’s approval at 46 percent positive to 51 percent negative.\n\n-- Hurricane Michael — The disruptions in electricity and phone service caused by the hurricane in the Panhandle – strong Republican territory — might change the composition of the people polled. It’s impossible to know how many Panhandle voters won’t participate in this year’s election.\n\n-- Methodology. The CNN survey asked people to describe their affiliations, with 32 percent Democrats, 29 percent Republican, and 39 percent independent.\n\nThe DeSantis campaign said the methodology of the poll is seriously flawed, which “renders the finding useless.”\n\nThe campaign said the sample “has more Independent voters than Democrats or Republicans and more Democrats than Republicans. However, in the 2010, 2012, 2014 and 2016 general elections more Republicans voted than Democrats or Independents.”\n\nStephen Lawson, a DeSantis spokesman, said in a written statement that the poll shows “why so many Americans believe that CNN peddles fake news.”\n\nCNN said its mix of Democrats, Republicans and voters who have no party affiliation or are members of a third party “almost exactly matches” the state’s registered voters.\n\n-- Outlier. Some polls are considered “outliers” by political professionals, meaning that for a variety of reasons they don’t get a good sample and the conclusions raise skepticism. Some political analysts have suggested the CNN poll might be an outlier.\n\nUntil the CNN poll released Sunday, the RealClearPolitics polling average had Gillum and DeSantis just 1 percentage point apart, with 45.3 percent for Gillum and 44.3 percent for DeSantis. Without CNN, the RealClearPolitics average in the Senate race had Scott and Nelson tied at 46.3 percent.\n\nIt’s possible that there’s been a big recent surge toward Gillum and Nelson, or the CNN poll could be an outlier.\n\nThe cable network acknowledged those possibilities in an article it published Monday about the poll. “The CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.”\n\nThe fine print\n\nIn the CNN poll, the research company SSRS used live callers to reach 759 likely voters by phone from Tuesday through Saturday. For likely voters, the pollster said the margin of error was plus or minus 4 percentage points.\n\nSEA said it used live callers to reach 600 registered voters and said its margin of error was plus or minus 4 percentage points.\n\nQuinnipiac surveyed 1,161 likely voters from Wednesday through Sunday using live callers. It reported a margin of error of plus or minus 4 percentage points.\n\naman@sunsentinel.com, 954-356-4550 or Twitter @browardpolitics", "link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "published": "2018-10-22T00:00:00"}, {"title": "CNN Poll: Democrats up in Florida with two weeks to go", "text": "WASHINGTON (CNN) As the final two weeks of campaigning begin, Democrats hold an edge in both the gubernatorial and Senate contests in the key state of Florida, according to a new CNN Poll conducted by SSRS. Democratic nominee Andrew Gillum holds a wide 12-point edge over his Republican opponent Rep. Ron DeSantis in the race for governor, while the Senate contest is a closer matchup with incumbent Democratic Sen. Bill Nelson at 50% to Republican Gov. Rick Scott's 45%.\n\nGillum's 54% to 42% lead rests on advantages among women (60% back him vs. 34% who say they favor DeSantis), non-white voters (74% back Gillum, 23% DeSantis), younger voters (60% for Gillum, 33% for DeSantis) and political independents (51% back Gillum, 42% DeSantis). Gillum has also consolidated Democratic support (97% favor him) in a way that DeSantis has not matched on the Republican side (88% back him).\n\nViews of Donald Trump are about as polarizing as partisanship in this race, which Trump has tweeted about multiple times. Among the 51% of likely voters who disapprove of the president, 92% back Gillum, while 87% back DeSantis among the 43% who approve of Trump.\n\nThe poll shows a wider lead for Gillum than some other recent telephone polling, nearly all of which was conducted before Hurricane Michael struck the state on October 10. Before the storm, public polling in mid- to late-September on these contests was mixed, with some (including surveys from Mason-Dixon and the University of North Florida) finding near-even races while others (including the Quinnipiac University and NBC News/Marist polls) gave the Democratic candidates the edge.\n\nThe CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.\n\nRead More", "link": "https://www.cnn.com/2018/10/21/politics/cnn-poll-florida-senate-governor/index.html", "published": "2018-10-21T00:00:00"}]}, "cnn_Rick Scott": {"link": "https://www.cnn.com/2018/04/09/politics/rick-scott-bill-nelson-florida/index.html", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}, "cnn_Dean Heller": {"link": "https://www.cnn.com/2017/07/19/politics/dean-heller-trump/index.html", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}, "cnn_Jacky Rosen": {"link": "https://www.cnn.com/2018/10/06/politics/womens-vote-key-states/index.html", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}, "cnn_Claire McCaskill": {"link": "https://www.cnn.com/2018/09/22/politics/islam-claire-mccaskill-radio-ad/index.html", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}, "cnn_Josh Hawley": {"link": "https://www.cnn.com/2018/10/01/politics/cnn-polls-missouri-nevada-senate/index.html", "articles": [{"title": "The Forecast: If Democrats win the House, it will be because of women", "text": "(CNN) House forecast: Democrats will win 226 seats (and the House majority) while Republicans will win just 209 seats. A Democratic win of 202 seats and 260 seats is within the margin of error.\n\nIf Democrats win the House, as we currently forecast, it will be because of women voters. The Democratic Party is currently benefiting from the largest gender gap on record for a midterm election.\n\nIn an average of the last five live interview generic congressional ballot polls , Democrats hold a substantial 22-point lead among women voters. That compares with a Republican advantage of 8 points among men voters. In other words, if only men were voting in this election, Republicans would not only hold onto their House majority, they would be expanding it.\n\nThe previous record high was 21 points in 2014. The 30-point gap in 2018 is 19 points higher than the average since the 1980s (when the gender gap first began to appear).\n\nThe gap seems to be driven by women's move to the left. By my calculations, there has never been a midterm in modern history in which women voted for Democratic candidates by more than 17 points. The current polling average suggests a margin of 5 points greater than that.\n\nKey to the current polling position of Democrats is that they are expanding upon the advantage that Hillary Clinton had with women in 2016. Whether you look at the exit polls or the Pew Research Center's study of validated voters, Democrats in 2018 are doing anywhere from 7 to 9-points better among women than Clinton did.\n\nEven better for Democrats is that if you had to choose between doing well with men or women, you'd prefer to do well with women voters. They make up a larger share of the electorate. Historically that hasn't meant much because the gender gap has been relatively small. The gap is becoming large enough this year that it could be worth 1 to 2 points to the Democratic margin. That may be what puts Democrats over the top, if they do indeed win the House majority.\n\nThe other part of why the gender gap is working in the Democrats favor is that Republicans are simply not doing well enough among men. Donald Trump won men by 11 points in 2016. To counteract the Democrats larger advantage with women, Republicans would need to be doing better than they did two years ago. The average poll does have them ahead, but by 3 points less than in 2016.\n\nThe 30-point gap between how men and women are voting is astounding, not just for historic nature (more on that in a minute), but for the fact that it seems to be holding or even expanding. When I looked at the gender gap in the early summer, it stood at 26 points. With just a few weeks until Election Day, it seems unlikely that the gap will shrink greatly.\n\nIt's also consistently shown up in every live interview poll. Sometimes when a trend appears in an average, it widely varies between polls. Not so here. In each of the last five polls, Republicans always lead among men. Democrats always lead among women. In all five, the gender gap is 24 points or greater. Put another way, even the pollsters that have the smallest gaps still show a historically large one.\n\nOf course, a gender gap doesn't guarantee Democratic success. If the polls are underestimating Republican strength among men and women, the gender gap may be as large as ever and Republicans may hold onto the House.\n\nFor now, the gender gap looks like it will power Democrats to a midterm victory.", "link": "https://www.cnn.com/2018/10/23/politics/the-forecast-democrats-gender-gap/index.html", "published": "2018-10-23T00:00:00"}, {"title": "Congress isn't likely to make Trump's new tax-cut pledge a reality anytime soon", "text": "The President has talked up the possibility of a 10% tax cut for middle-income Americans on the campaign trail and in the White House in recent days. But the idea, which appeared to materialize out of thin air, has taken Republicans on Capitol Hill by surprise and prompted Trump's own economic adviser on Tuesday to concede that a ny cuts \"may not surface for a while.\"\n\nWhen Trump first floated the idea of a new tax cut over the weekend, he suggested it could be unveiled ahead of the midterms. The House and Senate are out of session through the midterm elections, however, which are now just two weeks away.\n\nBeyond that, it's not clear there is any specific legislative proposal on Capitol Hill that would achieve the President's goal. And even if Republicans push for tax cuts after the midterms, it could be difficult, if not impossible, for any new tax cut to pass both chambers when lawmakers return to Washington for a lame-duck session before a new Congress takes over in January.\n\nWhen Trump debuted his new talking point, it sent aides on Capitol Hill spinning to figure out what he meant, and in the House it sent them rushing to figure out if they could -- or even need to -- draft something that would address what the President was talking about. In the Senate, GOP officials said calls and emails were sent to their House counterparts for guidance this past weekend, only to find out there wasn't any -- nobody was sure what exactly the President was referencing.\n\nWhite House officials, too, were caught off guard by the President's remarks. Some officials on the economic and legislative teams spent the weekend and early part of the week attempting to figure out where Trump got his new pitch and fielding confused phone calls from allies on Capitol Hill, according to two sources familiar with the internal reaction. There was also the open question of whether there was actual work to be done in formulating a new proposal or, as one of the sources put it, \"it was just something POTUS felt like tossing into the conversation in the weeks leading up the election.\"\n\nTo be sure, in a Republican-controlled House, legislative proposals can move quickly if prioritized by leadership, including bypassing the committee process altogether. But there are currently no plans to do anything of the sort, aides said -- primarily because nobody has pinned down what, exactly, the President is talking about.\n\n\"Your guess is as good as mine,\" one senior House GOP aide said.\n\nAs to whether something could eventually happen?\n\n\"I guess,\" the aide said. \"But it's not like we don't have a lot on our plate after the election.\"\n\nKey Republican chairman speaks up\n\nOn Tuesday, Rep. Kevin Brady, a Texas Republican who's the chairman of the powerful House Ways and Means Committee, the chamber's tax-writing body, said he will work with the Trump administration to come up with a plan in line with what the President has suggested, though he didn't offer any guarantees on whether it would pass.\n\n\"We will continue to work with the White House and Treasury over the coming weeks to develop an additional 10 percent tax cut focused specifically on middle-class families and workers, to be advanced as Republicans retain the House and Senate,\" Brady said in a statement.\n\nTrump cited the Ways and Means chairman in comments he made at the White House on Tuesday afternoon that Republicans would unveil details of the plan in the coming days.\n\n\"It's going to be a resolution, probably introduced this week, the end of the week or early next week,\" he said. \"And Kevin Brady has been drawing it up, actually, for a while. We've been working on it very hard for a pretty long period of time.\"\n\nOne congressional leadership aide told CNN before Trump's comments Tuesday that details are fuzzy and reiterated a slower timeline than Trump has promised in recent days, adding, \"No one knows how much it costs.\"\n\nOne potential obstacle for any new plan is that the House will be primarily focused on two things when it returns in November: the fallout from the election and funding the government\n\nIt is unlikely that any new tax proposal the President comes up with would win Democratic support, especially if Democrats win control of the House in the midterms. And why House GOP leaders -- including retiring Speaker Paul Ryan of Wisconsin -- would want to take up a new tax cut with no future in the Senate, as leadership battles are playing out and dozens of retiring or defeated members are heading for the exits , is an unanswered question.\n\n'Building on the success of the Tax Cuts and Jobs Act'\n\nHouse Republicans have already done their election year politics tax cut -- it was the \"Tax Reform 2.0\" package the chamber passed in September before recessing until after the election.\n\nThe House Ways and Means Committee moved that package of tax reductions through the legislative process. No such work has been done on Trump's new cuts -- in fact, no work on Capitol Hill had been done at all on a new tax reduction proposal of any kind, 10% or otherwise, senior GOP aides told CNN. That's because they weren't aware the President would call for a new proposal, the aides said.\n\nAsked for details of Trump's proposal at the start of the week, spokespeople for the speaker's office and the Ways and Means Committee initially referred all questions to the White House.\n\n\"I can tell you there is continued interest in building on the success of the Tax Cuts and Jobs Act and constantly improving the tax code for hardworking families and America's small businesses,\" Ways and Means Committee spokesman Rob Damschen said later in a statement. A spokeswoman for Ryan referred questions from CNN to the White House.\n\nTrump acknowledged on Monday that there would not be time for Congress to vote through new tax cuts before the November 6 midterms. \"We'll do the vote later. We'll do the vote after the election,\" he said.\n\nWhen the House passed its tax package in September -- which included permanently extending the 2017 tax cuts for individuals -- House GOP aides made abundantly clear what they were doing: trying to give their endangered incumbents another issue to campaign on.\n\nThe reason? There was no chance the Senate would take up the package -- it simply didn't have the votes. Unlike the 2017 tax overhaul, which needed only a simple majority to pass the chamber due to the use of an arcane budget process as its legislative vehicle, the second round would need 60 votes to move forward under Senate rules. Senate aides in both parties said the bill would fall far short of that number.\n\nBut despite the fact that the Senate is not expected to take up the House's pre-midterm tax package because it does not have the votes needed to pass, White House spokeswoman Lindsay Walters suggested on Monday that the President would like to see his tax cut for the middle class included as part of that package.\n\n\"As part of Tax Reform 2.0, the first elements of which ... passed the House in September, the President would like to see an additional tax cut of 10% for middle-income families,\" she said in a statement.\n\nOnly three House Democrats supported the second round of tax cuts, two of whom -- Reps. Jacky Rosen of Nevada and Kyrsten Sinema of Arizona -- are running in tough campaigns for Senate seats. The third was Rep. Conor Lamb, a moderate Democrat running in a Pennsylvania district that leans Republican.\n\n'It's a talking point'\n\nThat the effort undertaken was both known to be futile legislatively and proposed as a political tool for House Republicans goes to show just how far out of left field Trump's new talking point is on Capitol Hill. He's essentially asking for the same thing -- but without any legislative work backing his new idea and amid a deficit shown to be ballooning.\n\nKyle Pomerleau, an economist at the Tax Foundation, a nonprofit think tank in Washington, said it would be highly unlikely for the President's talked-about cut to pass either prior to the midterms or during the lame-duck period.\n\n\"We don't have details of any proposal, Congress is not in session to debate or take up any proposals and even if details were to miraculously appear and Congress came back to pass the President's plan, the final problem is that it is very unlikely it would pass both chambers of Congress,\" Pomerleau said.\n\nLarry Kudlow, the top economic adviser to the President, said Tuesday that Trump follows through on his promises, but Kudlow also acknowledged that the proposed tax cuts may not materialize in the near term, saying, \"It may not surface for a while ... but that's his goal.\"\n\nGiven the heavy lift and tricky political waters the House GOP leadership team will be facing as it attempts to prevent a government shutdown by the December 7 funding deadline -- one the President has all but called for if he doesn't secure significant financing for his border wall proposal -- there's limited appetite to move forward on anything more substantive, aides said, even as they left the door open to something happening if the President's economics team sent something substantive to the Hill.\n\nPrior to the introduction of Trump's new tax cut idea, Senate Majority Leader Mitch McConnell of Kentucky made clear that his priorities for the lame-duck session of Congress are funding the government and confirming more conservative judges for district and appellate courts -- something Senate Republicans have done at a record-setting pace throughout the 115th Congress.\n\nWhile House officials were more careful about addressing the future of the President's nonexistent tax cut proposal, colleagues in the Senate were less circumspect.\n\n\"It's a talking point,\" was how one senior GOP Senate aide put it. \"It's something to talk about in the lead-up to the election. Nothing more.\"\n\nA congressional leadership aide similarly told CNN that Congress controls the levers of taxation power \"but it gives the President something to talk about\" on the campaign trail.\n\nThat aide added, \"To Trump's credit, he has the ability to will things into existence from nowhere.\"", "link": "https://www.cnn.com/2018/10/23/politics/tax-cut-plan-congress-republicans/index.html", "published": "2018-10-23T00:00:00"}, {"title": "New texts cast doubt on Andrew Gillum's 'Hamilton' ticket explanation", "text": "(CNN) Democratic gubernatorial nominee Andrew Gillum received a ticket to the Broadway show \"Hamilton\" from a group that included an undercover FBI agent, according to text and email records released on Tuesday under subpoena by the lawyer for a former Florida lobbyist.\n\nThe revelation is the latest development regarding a federal investigation into public corruption in Tallahassee, Florida, where Gillum has been mayor since 2014.The records, which were subpoenaed by the state ethics commissions last week according to the Tampa Bay Times, cast doubt on the explanation from Gillum's campaign that the mayor received the ticket from his brother Marcus.\n\nThe FBI probe centers on whether developers successfully influenced city projects. At one point in the probe, an undercover agent successfully infiltrated Gillum's inner circle. No one has been charged with any wrongdoing.\n\nGillum has repeatedly said the FBI told him he is not a focus of the investigation. But his attendance at a Broadway show with lobbyist and longtime friend Adam Corey, along with his brother and the federal agent, who went by Mike Miller, has been used by political opponents to suggest Gillum is potentially under more direct scrutiny.\n\nAt issue is a 2016 trip to New York, where the group saw the hit musical \"Hamilton.\" Gillum's campaign has said his brother was the source for his ticket. But within the nearly 150 pages of records provided on Tuesday by Corey to ethics officials, text messages between Gillum and Corey present a murkier picture.\n\nRead More", "link": "https://www.cnn.com/2018/10/23/politics/andrew-gillum-texts-hamilton-corruption-investigation/index.html", "published": "2018-10-23T00:00:00"}]}}}