{"newspapers": {"foxnews_politics": {"link": "http://www.foxnews.com/politics", "articles": []}, "cnbc_politics": {"link": "https://www.cnbc.com/politics/", "articles": [{"title": "Dow drops more than 300 points after disappointing earnings from Caterpillar and 3M", "text": "Stocks fell sharply on Tuesday as corporate results from Caterpillar and 3M disappointed investors.\n\nThe Dow Jones Industrial Average dropped 347 points, with Caterpillar and 3M as the biggest decliners. The S&P 500 plunged 1.5 percent as the industrials and energy sectors underperformed. The Nasdaq Composite fell 1.5 percent, entering correction territory as investors continue to dump tech-related shares such as Amazon. The small-caps Russell 2000 dropped 1.4 percent and turned negative for the year.\n\nThe S&P 500 was on pace for its fifth straight weekly decline and traded below the lows hit earlier this month during this ongoing sell-off. The major indexes are all down at least 5.9 percent for October.\n\nCaterpillar dropped 7 percent following the release of its results. The company said its manufacturing costs rose due to higher material and freight costs. Material costs were driven by higher steel prices and tariffs. This drop adds to Caterpillar's steep monthly losses. Through Monday's close, the stock is down 15.6 percent for the month.\n\nThe U.S. and China have implemented tariffs on billions of dollars worth of their goods this year, increasing costs for companies and raising fears that tighter global trade conditions could slow down the global economy. Negotiations between the two countries have stalled recently, increasing fears that this spat will be prolonged.\n\n\"We just look like we're getting further away from a deal with China,\" said Art Hogan, chief market strategist at B. Riley FBR. \"The ramifications of a prolonged trade war are really seeping into investors' minds right now.\"\n\n\"I think we're coming to a capitulation point,\" he said.", "link": "https://www.cnbc.com/2018/10/23/dow-set-for-triple-digit-losses-at-the-open-amid-rising-global-tensions.html", "published": "2018-10-23T00:00:00"}, {"title": "European stocks fall to lowest levels since 2016", "text": "The pan-European Stoxx 600 was provisionally down 1.49 percent by the end of trade, slipping to its lowest level in almost two years. Germany's DAX index led the losses among the major bourses, falling more than 2 percent. The export-heavy DAX is seen as particularly exposed to any slowdown in global demand.\n\nEurope's technology stocks were among the worst performers, falling by over 3.6 percent amid earnings news. Shares of Austrian chipmaker AMS tumbled almost 27 percent after the company's outlook for the final three months of the year failed to convince investors.\n\nFinland's Wartsila posted weaker-than-expected quarterly profit on Tuesday, citing subdued demand for its service business. Shares of the ship technology and power-plant maker fell almost 8 percent on the news.\n\nMeanwhile, Britain's Travis Perkins surged towards the top of the European benchmark after it said its full-year performance was in-line with expectations. The U.K.'s largest supplier of building materials said solid demand from trade buyers offset pressure in other areas of its business. Shares of the London-listed stock rose around 3.5 percent.\n\nElsewhere, the European Commission told lawmakers in Italy that it must make revisions to its draft budget proposal. This sent bond yields higher and further weighed on sentiment towards stocks listed on the FTSE MIB. Italy's Deputy Prime Minister Luigi Di Maio claimed that the EU ruling was no surprise, but his country could not continue with past policies that enforced low fiscal spending.", "link": "https://www.cnbc.com/2018/10/23/european-markets-khashoggi-crisis-italy-budget-brexit-in-focus.html", "published": "2018-10-23T00:00:00"}, {"title": "Asia markets: Saudi Arabia, US-China trade war, currencies in focus", "text": "Asian markets fell across the board in on Tuesday as investors remained cautious amid rising global tensions.\n\nThe Greater China markets fell, reversing gains seen over the last two sessions. The Shanghai composite shed 2.26 percent to close at 2,594.83 while the Shenzhen composite declined 1.92 percent to 1,300.29.\n\nMeanwhile, Hong Kong's Hang Seng index fell 3 percent in afternoon trade.\n\n\"Yesterday's 4.1% rally in the Shanghai Composite Index is likely to have been a dead cat bounce,\" strategists at DBS Group Research wrote in a morning note. \"Any stimulus by China should be viewed not as a boost but as a cushion against a slowing economy against external headwinds.\"\n\nIn South Korea, the Kospi fell 2.57 percent to 2,106.10, closing at a low not seen since March 2017.\n\nIn Japan, the Nikkei 225 was down 2.67 percent to close at 22,010.78 while the Topix index fell 2.63 percent to 1,650.72.\n\nOne investor suggested that the time is not ripe to re-enter Asian markets.\n\n\"In the short term, we believe that the U.S. dollar is still a bit too strong and also, interest rates in the U.S. are likely to continue to rise and also, the trade tensions at the moment are still a little bit too high,\" Khiem Do, head of Asian multi-asset at Barings, told CNBC's \"Squawk Box\" on Tuesday.\n\n\"I think that we need to see those three catalysts actually improving somewhat for us to re-enter into... the markets,\" he said.\n\nAustralia's ASX 200 closed down 1.05 percent at 5,843.1, with the heavily-weighted financial sector falling 1.18 percent and the energy subindex declining 3.21 percent.\n\nShares of hospital operator Healthscope jumped 19.33 percent Down Under after the company said it had received a takeover proposal from a consortium for 4.11 billion Australian dollars ($2.9 billion), according to Reuters.", "link": "https://www.cnbc.com/2018/10/23/asia-markets-saudi-arabia-us-china-trade-war-currencies-in-focus.html", "published": "2018-10-23T00:00:00"}, {"title": "Gold hits three-month peak as stocks slide, palladium at record", "text": "Gold jumped 1 percent to a more than three-month peak on Tuesday, with investors spurred on by a slide in global equities and rising political and economic uncertainty, including concerns over Italy's spending plans.\n\nPalladium soared to a record high, with additional support from expected renewed demand from the Chinese automotive sector.\n\nSpot gold was up 1 percent at $1,234.05 an ounce, having touched its highest since July 17 at $1,239.68.\n\nU.S. gold futures rose 1 percent to $1,236.90, also helped by positive currency fundamentals as the dollar turned lower.\n\n\"Gold is supported by rising risk aversion washing through the markets and that is reflected in falling equity markets worldwide,\" said Societe Generale analyst Robin Bhar.\n\n\"Political uncertainty in Italy, geopolitical risks in the Middle East, Turkey and elsewhere had some safe-haven flows coming in and extending the rally in gold prices that began a couple a weeks ago.\"\n\nGold prices have gained more than 6 percent after falling in mid-August to their lowest since January 2017 at $1,159.96 an ounce.\n\n\"Now we have risen above the 100-day moving average (around $1,224), which is key, so maybe we can see it rise to $1,250, which could be the next target,\" said Commerzbank analyst Carsten Fritsch.\n\nEARNINGS DISAPPOINTMENTS\n\nWorld shares sank towards their lowest level in a year, pressured by disappointing corporate earnings, Saudi Arabia's diplomatic isolation to a brewing spat over Italy's finances.\n\nThe European Commission decided to reject Italy's 2019 budget and asked Rome to present a new document within three weeks.\n\n\"We have a whole series of situations in connection with Saudi Arabia and Russia, and trade tensions between U.S. and China, and that has been having a knockdown impact on equities and in turn providing support to gold prices,\" said Capital Economics analyst Ross Strachan.\n\nInvestor flows into bullion, often considered a safe store of value during times of economic and political uncertainties, also continued to increase.\n\nHoldings at the world's largest gold-backed exchange-traded fund, SPDR Gold Trust, rose 0.3 percent to 747.88 tonnes on Monday.\n\nMeanwhile, palladium was up 1.05 percent at $1,134.70 an ounce.\n\nUsed mainly in emissions-reducing autocatalysts for vehicles, palladium has gained some 7 percent so far this year to hit a record $1,150.50 an ounce, about $100 away from the price of gold.\n\nA combination of factors, from tight supplies and large deficits to resurgent interest from speculative investors, has kept the platinum group metal (PGM) on the boil.\n\nAmong other precious metals, silver rose 0.89 percent to $14.74, while platinum was up 1.45 percent at $832.", "link": "https://www.cnbc.com/2018/10/23/gold-markets-saudi-arabia-brexit-italian-budget-in-focus.html", "published": "2018-10-23T00:00:00"}]}, "washingtonpost_politics": {"link": "https://www.washingtonpost.com/politics/", "articles": [{"title": "So many people are buying Mega Millions tickets that number combinations are running out", "text": "Just stop somewhere — a coffee shop, the grocery store checkout, or your office — and listen.\n\nOdds are, someone within earshot is hatching a plan to buy mansions and yachts as long as a city block. But of course, many are sure to explain, they will divert serious cash to charity after winning what lottery officials call the biggest lottery jackpot in history.\n\nTuesday’s Mega Millions drawing will pay out at least $1.6 billion to winning jackpot ticket holders, if there are any, after Friday’s already record-setting drawing ended with no ticket matching all six numbers. That number is “uncharted territory” for Mega Millions, lottery officials said.\n\nAnd the chances are rising that a winner or winners will emerge after the numbers are called.\n\nBy then, lottery officials estimate 75 percent of all number combinations will be purchased, Maryland Lottery and Gaming spokeswoman Carole Gentry told The Washington Post. There are 302,575,350 possible combinations — which are the odds of winning.\n\nThat fever has struck nationwide.\n\nOn Thursday, ahead of the last drawing, in California players were buying 200 tickets a second, the Associated Press reported.\n\nBack on the east coast on Friday, about 9,100 tickets were purchased a minute in Maryland in a two hour window ahead of the drawing, state lottery officials said.\n\nThe Virginia Lottery projects sales after Friday’s drawing through Tuesday’s drawing will approach $19 million, lottery spokeswoman Jennifer Mullen said. In the sales peak, as many as 12,700 tickets will be sold per minute, Mullen said.\n\nWhat’s my payout if I win?\n\nThe estimated cash option is about $905 million should a winner choose to take a one-time lump sum payment instead of annual payouts over 30 years, according to Mega Millions officials.\n\nBut that’s before taxes. You’d get about half of that after state and federal taxes take a big bite of your winnings, the AP reported. The annual payouts would net a higher payout over time, but you would have to squirrel away enough money to buy, say, a struggling NFL team.\n\nAnd if you take the annual payouts rather than the lump sum, you may even be an eventual billionaire. The website USAMega.com breaks down what your winnings could look like after taxes for your state. Even highly taxed states like New York show figures cresting a billion dollars after 30 years of payments.\n\n[You’ve won the Mega Millions jackpot! Time to hide.]\n\nIs it me, or are lottery jackpots huge these days?\n\nIt’s not just you. Lottery officials count on enormous jackpots to draw in players who would ordinarily avoid participating, so last October they made two big changes. They doubled ticket prices to $2 — and tweaked the formula to make it easier to win smaller prizes but harder to win the jackpot.\n\nHere’s how Mega Millions used to work: Players picked five numbers from 1 to 75 and a Mega number from 1 to 15. The odds of winning the top prize were 1 in 258,890,850.\n\nSince Mega Millions modified the formula, players now pick five numbers from 1 to 70 and a Mega number of 1 to 25. The odds of winning the jackpot are now 1 in 302,575,350.\n\nIn other words, reducing the number of balls for the first five numbers increases the chances of winning a smaller prize. But raising the number of Mega Balls makes it harder to win the jackpot. (You still win the big jackpot by matching all six winning numbers in a drawing.)\n\nPowerball made similar changes to its rules in 2015. That game itself is currently at a monster jackpot, though a small one relative to Mega Millions, at $620 million ahead of Wednesday’s drawing.\n\nDo people think they’re going to win?\n\nThey do.\n\n“I believe I already won,” Joseph Rauch told Reuters, “believe I believe in the law of attraction. So what’s meant to be is already gonna be.”\n\nOthers are already self-read experts on how to deal with such an enormous and public prize. “I would incorporate myself as a business and become my own company,” Gregory Baron said in New York City.\n\nAnd even apparent fatalists are wandering to the corner store for a shot at the jackpot.\n\nHank Kattan is 75 years old. He does not expect to win at all. And yet.\n\n“I’ll never win, but you gotta give it a shot,” he told Reuters. “I’d like to change my way of life.”\n\nAmy B Wang and J. Freedom du Lac contributed to this report.\n\nRead more:\n\nHe returned the orange juice to save money — and picked up a winning $315 million lottery ticket\n\nWinner of a $560 million Powerball jackpot can keep the money and her secret, judge rules\n\nPerspective | How ’80s excess fueled today’s Mega Millions mania\n\nShe bought her first lottery ticket on her 18th birthday — and now she’s set for life", "link": "https://www.washingtonpost.com/business/2018/10/23/so-many-people-are-buying-mega-millions-tickets-that-number-combinations-are-running-out/", "published": "2018-10-23T00:00:00"}, {"title": "You’ve won the Mega Millions jackpot! Time to hide.", "text": "First things first: Quadruple-check your ticket after Tuesday’s Mega Millions drawing. Then do it again.\n\nDo they match the winning numbers?\n\nNo? Skip to here.\n\nYes? Lock the deadbolt and read on.\n\nCongratulations!\n\nSo, you’ve done it. Beaten the odds — one in 302,575,350 — and won the largest Mega Millions jackpot in U.S. lottery history. Perhaps you’re splitting the $1.6 billion grand prize with another winning ticket or two. Either way, you’re almost certainly about to enjoy an astronomical spike in wealth.\n\nNow what?\n\nBefore you shout from the rooftops or broadcast your excitement on social media, take a deep breath and keep some practical advice in mind.\n\nTo sign or not to sign the back of the lottery ticket?\n\nThere are plenty of people who will advise you to sign the back of the lottery ticket right away. After all, what would happen if, heaven forbid, you lost the ticket? Or worse yet, if an unscrupulous person in your life took the unsigned ticket and claimed it as his or hers?\n\nNot so fast.\n\nSome states require lottery winners to be publicly identified, while in others, they can remain anonymous if they claim the prize through an anonymous trust or a limited liability company (more on that later). However, signing the back of the lottery ticket with your real name may bind you to claiming the prize under that name, thus releasing your identity to the public even if that’s not what you want.\n\n[He returned the orange juice to save money — and picked up a winning $315 million lottery ticket]\n\nEarlier this year, a New Hampshire woman who won a $560 million Powerball jackpot found herself in just such a predicament: She wanted to claim the prize under an anonymous trust but had already signed the back of her ticket with her real name.\n\nA judge eventually ruled she could keep the money and her privacy but, as The Washington Post’s Cleve R. Wootson Jr. reported, she lost about $14,000 in interest every day the case remained unresolved.\n\nWhat may be more advisable is keeping the ticket in a secure place, such as a safe, while you consult with an attorney.\n\nThat way, if you decide to create a trust or an LLC through which to claim your prize, you can sign the back of the ticket with the name of those entities instead.\n\nSpeaking of attorneys ...\n\n“The three phone calls I would make: lawyer, accountant, financial adviser,” said Randy Zelin, a New York-based litigation attorney.\n\nA lawyer who specializes in trusts and estate planning would be ideal, but the most important thing to remember is that your privacy is paramount, Zelin said this week.\n\nA few years ago, Zelin cringed as he watched another attorney parade his clients — a Tennessee family that had won a $500 million Powerball jackpot — onto the “Today” show to announce their winnings.\n\n“That goes down in the annals of 'What exactly were you thinking?’” Zelin told CNN at the time.\n\n[So many people are buying Mega Millions tickets that number combinations are running out]\n\nAn attorney can help you navigate what you are obligated to divulge under the terms and conditions of your ticket and your state’s public disclosure laws.\n\n“You want to discuss everything from the vehicle that you’re going to use for the money to go to, how to handle the publicity, understanding what your rights are and your obligations are in terms of making yourself available and the use of your likeness,” Zelin told The Post.\n\nThese may seem like unnecessary precautions now, but lottery winners are famously susceptible to becoming targets for everything from extortion to blackmail to even kidnapping.\n\nThere will certainly be people who approach you for handouts if your name is public.\n\n“You don’t need every family member you never heard of coming out of the woodwork,” Zelin said. “You want to be as low-key and have this money lawyered and away from prying eyes as you possibly can. Just about the last thing you want to do is be public when you win.”\n\nFind a good accountant and financial adviser, too\n\nMega Millions allows jackpot winners to claim the grand prize either through a onetime lump-sum cash payment or through annual payments over 30 years. In the case of Tuesday’s big prize, the lump-sum cash option will be an estimated $905 million, while the annuity payments would, eventually, amount to $1.6 billion.\n\nA reliable accountant can ensure you understand the tax consequences in your state for both options. The website USAMega.com breaks down what your winnings could look like after taxes for your state.\n\n[She bought her first lottery ticket on her 18th birthday — and now she’s set for life]\n\nThe benefit of the smaller lump sum, of course, is that you get more money right away. That can also be a drawback for people who are not used to wealth.\n\n“There’s nothing inherently different about lottery winnings than it is about other kinds of wealth that’s created,” said Michael S. Arlein, a trust and estate planning lawyer. “But I think often lottery winners don’t come from money, and so they instantaneously have to deal with money. One day they have none, and the next day they have a huge amount. So I think there’s probably a learning curve that exists for lottery winners that doesn’t exist for people who made their money over a longer period of time.”\n\nAfter you’ve decided whether you want to take the lump sum, a financial adviser can help ensure it’s managed and invested wisely.\n\nAs The Post has reported, there are countless stories of people whose lottery winnings have vanished almost as quickly as they won it.\n\nOther lottery winners have realized that every ticket buyer’s fantasy can quickly morph into a nightmare. There are myriad self-inflicted problems that can befall a person who suddenly comes into great wealth. One bought a water park, for example. Several others have gambled their winnings away, including a two-time lottery winner who ended up living in a trailer. Billie Bob Harrell Jr., who won $31 million in 1997, told his financial adviser shortly before his suicide that “winning the lottery is the worst thing that ever happened to me.”\n\n“How many stories have we heard?” Zelin said. “You’re now a piñata if you allow yourself to be. You really need to be very smart.”\n\nThe number one thing to try to hold onto is patience.\n\nMega Millions winners have between 180 days to one year from the date of the drawing to claim their prize, depending on the state in which the winning tickets were purchased.\n\nThat should allow ample time to hire a lawyer, create a trust if necessary and prepare, prepare, prepare.\n\n“You don’t want to do anything too quickly. You have time,” Zelin said. “There’s no need to make any sudden moves, and you want to be very smart about the way you handle it because things happen at about 400 miles an hour and you want to be prepared for it. There’s no substitute for preparation.”\n\nRead more:\n\nA hospital worker won the Powerball. Her prize: $758.7 million — and police outside her house.\n\nSo many people are buying Mega Millions tickets that number combinations are running out\n\nHow Mega Millions changed the odds to create a record-breaking $1.6 billion jackpot\n\nPer capita lottery spending has doubled since 1995", "link": "https://www.washingtonpost.com/business/2018/10/23/youve-won-mega-millions-jackpot-time-hide/", "published": "2018-10-23T00:00:00"}, {"title": "Utah refused to prosecute four sexual assault cases, so the alleged victims set out to do it themselves", "text": "One petitioner was a 17-year-old high school senior when she alleged that a classmate had raped her. Another claimed her co-worker had assaulted her. The third petitioner accused a police chief of raping her several times while she was volunteering in his department. And the fourth, now 30, said she was assaulted by a massage therapist.\n\nAll four cases were reviewed by the local prosecutor’s office, which declined to file charges.\n\nNow the four Utah residents are using a novel approach to make their voices heard: a provision in the state’s constitution that permits alleged crime victims to request that the state Supreme Court appoint a prosecutor if a district attorney refuses a case.\n\nThe constitutional clause is unique to Utah, but the concept of victim-initiated prosecution is available in other states.\n\nAttorneys for the women are optimistic that if they succeed in Salt Lake County, the ruling will create a viable blueprint for other states.\n\nSalt Lake County District Attorney Sim Gill called the petition an “intriguing thing that’s never been challenged.” Still, Gill joins a number of lawyers who worry that a successful lawsuit will pave the way for thousands of frivolous petitions in many types of cases.\n\nIn the past two years, all four women — known in their recently filed lawsuit as “the Jane Does” — said they were attacked by someone they knew and reported the assault within days.\n\nJane Doe 1, now 18, told The Washington Post that she hopes to help other victims be heard.\n\nAfter the Salt Lake County District Attorney’s Office declined to prosecute the case, the teenager’s high school allowed her alleged rapist back on campus.\n\n“It made me feel so vulnerable and scared,” she said. “We think the law will protect those who have been wronged. I don’t want another girl going through this again. I want to make it easier to get help and to have the law believe you.”\n\nThe lawsuit is the first time in Utah’s 120-year history that anyone has approached the issue this way, Paul Cassell, a former federal judge and professor at the University of Utah’s S.J. Quinney College of Law, told The Post.\n\nHistorically, the nation rarely questions a law enforcement decision to decline bringing charges. “The sexual assault under-prosecution problem is forcing people to reevaluate that,” he said.\n\nInstead of requesting sweeping interference with law enforcement decisions, the lawsuit asks for a specific ruling on a case that has been turned down for prosecution.\n\n[Police in many states could legally have sex with a person in custody — until a N.Y. rape allegation]\n\nThe suit comes amid heated national dialogue about sexual abuse, as the #MeToo movement has emboldened more women to speak out. It was further fueled by the confirmation hearings of Supreme Court Justice Brett M. Kavanaugh, which were shadowed by outrage over decades-old allegations of sexual assault.\n\nThe consensus, according to attorney Bethany Warr, who represents three of the Jane Does, is that sexual assault cases are under-prosecuted, though there are places where it’s more pronounced than others.\n\n“They have a tendency to be declined by district attorneys, and fairly so — they’re difficult cases,” Warr said. The lawsuit aims to further the dialogue about why juries are so hard on sex-crime victims and why society has such a hard time believing them, she said.\n\nSex-crime prosecutions are widely accepted as some of the most challenging in the criminal justice system.\n\nSexual assaults rarely happen with other witnesses present, and anything that deviates from the cliche of a masked, armed man committing a rape in an alleyway adds a variable that must be explained to frequently judgmental juries.\n\nIn Salt Lake County, Cassell said, assistant district attorneys operate under outdated notions of what cases are winnable, saying that prosecutors who are fearful of losing are the real barrier to successful prosecutions.\n\nGill, who is up for reelection this year, agreed that these are difficult cases for prosecutors. But, he said, that doesn’t mean his office refuses to prosecute them.\n\nAn average of 44 percent of violent crimes are reported to law enforcement and result in arrest, according to a statement released by Gill on Tuesday. Sexual crimes, he said, vary dramatically.\n\nIn Utah, 12 percent are brought forward — meaning 88 of 100 people fail to report sexual assault claims, Gill told The Post. He also said that last year, his office filed charges in 39 to 40 percent of 600 sexual assault reports, consistent with the national average.\n\nGill said there’s a social stigma associated with sexual assault, and because only a small percentage are reported, a systemic attrition happens.\n\n“We need to figure out what the balance is — to reassure victims that we see and hear them, while asking if the interests of justice will be met by bringing the case forward. Can we meet the legal burden in good faith?”\n\nGill pointed out that sexual assault cases have nuanced complexity. One major consideration, he said, is whether to re-traumatize a victim by having her testify in a case that would be challenging to win.\n\nDeborah Tuerkheimer, a professor at Northwestern University’s School of Law and a former prosecutor, said, “The problem with prosecutors is that they’re not just thinking about legal sufficiency, they’re thinking about convictability” — the likelihood that 12 jurors can be convinced beyond a reasonable doubt. “Often, jurors are unpersuaded because of biases and rape myths. When prosecutors take that into account in charging decisions, even anticipatorily, they’re embedding them into the system.”\n\nThe #MeToo movement heightened awareness of the prevalence of sexual assault. Part of the benefit is that people better understand what sexual violence looks like, which mitigates assumptions about the type of person who perpetrates these crimes and how a survivor “should” behave, Tuerkheimer said.\n\nThe petitioners remain hopeful that the Utah Supreme Court, which has the petition under advisement, will direct the attorney general’s office and other government agencies to file briefs in response.\n\nEach of the Jane Does wants to fight for the right to hold her alleged abuser accountable. Jane Doe 4 told the Salt Lake Tribune: “I did everything that I needed to do and I did it as strongly as I could,” she said. “I didn’t realize how disappointing and heartbreaking it would be.”\n\nBy putting their stories into circulation, they hope to challenge old injustices and forge change within the criminal justice system.\n\nRead more:\n\nFormer state GOP official warns Trump protesters: Montana is an ‘open carry state’\n\nA black child’s backpack brushed up against a woman. She called 911 to report a sexual assault.\n\nVideo shows woman leaving toddler on stranger’s doorstep in Texas and running away", "link": "https://www.washingtonpost.com/nation/2018/10/22/utah-refused-prosecute-their-sexual-assault-cases-so-four-women-set-out-do-it-themselves/?utm_term=.209c151f74d8", "published": "2018-10-22T00:00:00"}, {"title": "Migrant caravan: Fox News panel on border-bound caravan in Mexico goes awry", "text": "\n\n\"Fox & Friends\" co-hosts Steve Doocy, left, Ainsley Earhardt and Brian Kilmeade on their set in New York in January. (Richard Drew/AP)\n\nReporter\n\nSteve Doocy was about 30 seconds into Monday’s episode of “Fox & Friends” when he announced a Fox News alert.\n\n“We’ve got a Fox News alert!” he said.\n\n“FOX NEWS ALERT” blared a big red graphic on the screen.\n\nIt turned out to be pretty much the same alert “Fox & Friends” issued on Sunday, Saturday, Friday — and very possibly other episodes going back to mid-October: A caravan of migrants was slowly walking across Central America toward the U.S. border.\n\n“The migrant caravan in Central America is growing,” Doocy said when the alert graphic stopped obscuring his face.\n\n“Seven thousand strong!” said his co-host Ainsley Earhardt.\n\nThey cut to live footage of a Texas border city — approximately a 400-hour walk from the caravan’s position in southern Mexico — where a Fox News correspondent was stationed on the ground.\n\n“Is he going to be seeing 5,000 people storm the border soon?” asked Brian Kilmeade, the other co-host.\n\nYou might think so, to take a spin through the big conservative news sites.\n\n[Trump apparently misunderstands ‘Fox & Friends’ joke, makes baffling tweet]\n\nThe caravan was front and center on Breitbart and the Drudge Report on Monday, as it has been often since several hundred people formed it in Honduras around Oct. 12 and started walking north.\n\nMeanwhile, President Trump — “Fox & Friends” watcher-in-chief — just called the caravan a “National Emergy” on Twitter. Trump said the caravan has “Criminals and unknown Middle Easterners mixed in,” and the Mexican military can’t stop it, and also that it was organized by Democrats to hurt Republicans in the U.S. midterm elections.\n\nHave not seen a single “Middle Easterner” in the caravan, @realDonaldTrump. Have seen hundreds of women and children and babies, though. https://t.co/skzF0IEGCi — Kate Linthicum (@katelinthicum) October 22, 2018\n\nThe Washington Post, CNN, the Associated Press and many other mainstream outlets have covered the migrants' journey with considerably less foreboding, just as they did a smaller caravan that petered out before it reached the U.S. border earlier this year.\n\nAmong the 5,000 or so people who crossed the Guatemalan border into southern Mexico this weekend, Kevin Sieff reported for The Post, are a call center worker who grew up in the United States and wants to return; a wood-flooring installer who was deported from Phoenix six months ago and still has a 6-year-old son there; and uncounted families fleeing poverty or organized violence in their home countries.\n\nThey travel together for safety as they cross regions controlled by gangs and drug cartels. Most of them hope to seek asylum at the border or — more likely — to try to cross into the United States illegally.\n\nSo despite the caravan’s size, it’s no different in purpose than smaller mass migrations that routinely cross Central America.\n\nThe last one passed through last spring, drawing its own entourage of reporters and outraged tweets from Trump. It grew to about 1,000 people, which, it turned out, was too large for purposes of logistics, and so the caravan disbanded in Mexico City long before it reached the U.S. border.\n\nIt’s unclear how a group at least five times larger — apparently reliant on food and water from passersby — hopes to make it any farther.\n\nThat context was not in Monday’s Fox News alert.\n\nSome of it came across later in the episode — perhaps unintentionally — when Doocy brought out a panel of four people identified as independent voters and asked about the caravan.\n\n“It’s north of apparently 7,000 people strong,” Doocy told the first independent voter, Michael Willner. “How big a problem is that, that the United States has uneven immigration laws?”\n\n“I think uneven immigration laws are a problem for any country, and I think our immigration laws need to be modernized and updated,” Willner said.\n\n[‘He chose to blow it’: A rare dissent from the couch of ‘Fox & Friends’ after Trump attacks Ford]\n\n“But this country is founded on immigration,” he continued. “And all of us come from immigrants.”\n\nDoocy tried again.\n\n“By the time it gets here, it could be 10,000. It could be 20,000,” he said. “What should the United States do?”\n\n“This is the mightiest country on the planet,” Willner replied. “I think we can handle a caravan of people, unarmed, coming to this country.”\n\n“Okay,” Doocy said, pointing to the second independent voter. “Cathy: real quick.”\n\n“I think the immigration crisis we’re seeing is a result of the failure of the two democratic parties to actually engage the issue,” said Cathy Stewart, with the New York Independence Party.\n\n“Mm-hmm,” said Doocy.\n\n“Instead, they use it like a partisan football,” she continued.\n\n“Sure,” said Doocy. And, moving on: “John, real quick.”\n\nBut John Opdyke continued the previous independent voters' line of thought.\n\n“There’s a humanitarian crisis taking place in Central America, and yet this issue gets turned into a complete political football,” he said. “There’s very little honest discussion about what’s actually happening.”\n\n“And Aaron?” Doocy said. His voice had fallen to something like a raspy whisper.\n\n“Treating this as an ‘invasion’ is a bad idea, and it’s going to end horribly if it is treated such as that way,” said Aaron Commey, a libertarian and the final independent voter on the panel.\n\nDoocy collected his notes and sat up on his stool.\n\n“Sure, but the backdrop is the midterms, so it all becomes political,” he told the voters. “So let’s see what happens!”\n\nAnd with that, Fox & Friends dispensed with Monday’s migrant news alert and moved on to the subject of Democratic Sen. Elizabeth Warren’s DNA.\n\nThe next episode airs Tuesday morning. Perhaps another Fox News alert will pop up then, too.\n\nRead more:\n\nNavigating the border: The barriers that define the U.S.-Mexico borderline", "link": "https://www.washingtonpost.com/politics/2018/10/22/fox-friends-voter-panel-rebels-when-asked-about-migrant-caravan/?utm_term=.0c9b51e623e6", "published": "2018-10-22T00:00:00"}]}, "cnn_politics": {"link": "https://www.cnn.com/politics", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Bill Nelson": {"link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "articles": [{"title": "Hear new episodes of the true-crime podcast Felonious Florida now", "text": "A stunning triple murder, a killer clown and mysterious text messages from a missing woman.\n\nThe hit podcast Felonious Florida is back with a second season featuring three new stories from the Dark Side of the Sunshine State.\n\nIn Episodes 1 and 2, investigative reporter Stephen Hobbs follows the case of a brutal 2009 triple murder.\n\nThe sole survivor had been shot in the head, and her inconsistent memories of the ordeal were making it difficult for detectives to find a suspect. The case ended in a stunning courtroom drama, and Hobbs investigated what happened.\n\nLISTEN TO THE NEW EPISODES HERE\n\n“The state of Florida is rich with captivating stories,” said Julie Anderson, editor-in-chief of the South Florida Sun Sentinel. “The Sun Sentinel’s archives are filled with high-profile crime stories and we are pleased to be bring a second season of compelling stories to listeners with fresh and new information.”\n\nThe seven-part season also includes “The Disappearance of Lisa Spence,” in which text messages from the phone of a woman who had vanished led police to the discovery of her violent end. And “The Killer Clown,” a story of one of Florida’s most sensational murders that revealed some of the darkest parts of the state.\n\nHosted by EmmaKate Austin, Felonious Florida is produced by the South Florida Sun Sentinel in partnership with Wondery.\n\nSeason 1, which launched on April 3, 2018, reached the No. 1 spot on Apple Podcasts and in June was named the best new true-crime podcast of the year by The AV Club.", "link": "https://www.sun-sentinel.com/news/florida/fl-fea-felonious-florida-season-2-premiere-20181001-story.html#nt=notification", "published": "2018-10-01T00:00:00"}, {"title": "CNN Florida poll has good news for Andrew Gillum and Bill Nelson – maybe too good", "text": "Andrew Gillum is way ahead and Bill Nelson is leading in the latest big-name poll of Florida voters.\n\nBut the CNN poll doesn’t mean Democrats should celebrate or Republicans despair. The numbers may not be as good as advertised for Democrats Gillum and Nelson or as bad for Republicans Ron DeSantis or Rick Scott.\n\nIn the governor’s race, the CNN poll conducted Tuesday through Saturday shows Gillum with support from 54 percent of likely voters to 42 percent for DeSantis. That’s a 12 percentage point advantage for Gillum.\n\nIn the U.S. Senate race, CNN has Nelson leading Scott among likely voters, 50 percent to 45 percent. That’s a Nelson lead of 5 points.\n\nCNN has the famous brand name, but its poll might be overstating support for the Democratic candidates and understating support for the Republicans.\n\nAnother survey, from SEA Polling & Strategic Design, which generally polls for Democrats, found closer contests.\n\nIn the governor’s race, SEA found 48 percent for Gillum to 42 percent for DeSantis among registered voters.\n\nIn the Senate race, SEA found Scott leading Nelson, 47 percent to 45 percent among registered voters.\n\nThe poll from SEA was conducted from Wednesday through Saturday.\n\nGillum, the Democratic candidate for governor, is currently the mayor of Tallahassee. Republican DeSantis was serving his third term as a member of Congress from northeast Florida until he resigned last month to campaign full time.\n\nThe candidates met for their first debate Sunday night.\n\nDemocrat Nelson is seeking a fourth term in the U.S. Senate. Republican Gov. Rick Scott can’t run for a third term as governor because of term limits, so he is running against Nelson.\n\nBolstering the CNN numbers was a Quinnipiac University Poll of the Senate race released on Monday. The poll found Nelson with 52 percent support among likely voters to 46 percent for Scott.\n\nQuinnipiac hasn’t released results in the governor’s race.\n\nAmong the reasons to be cautious about the CNN numbers:\n\n-- Trump response — The CNN survey found more Florida voters disapprove (50 percent) than approve (42 percent) of President Donald Trump’s performance, a net negative of 8 percentage points.\n\nThat’s not unusual. Virtually every public opinion poll shows more disapproval than approval for the president.\n\nWhat is unusual is the comparison to the national average. RealClearPolitics reports the average of national polls shows 52 percent disapproval and 44 percent approval of Trump, a net negative of 8 points.\n\nThat’s strikingly similar to the percentages CNN reported in Florida. Throughout his presidency, Trump has had notably higher favorable percentages and lower unfavorable percentages in Florida than the nation.\n\nThe Quinnipiac Poll reported Trump’s approval at 46 percent positive to 51 percent negative.\n\n-- Hurricane Michael — The disruptions in electricity and phone service caused by the hurricane in the Panhandle – strong Republican territory — might change the composition of the people polled. It’s impossible to know how many Panhandle voters won’t participate in this year’s election.\n\n-- Methodology. The CNN survey asked people to describe their affiliations, with 32 percent Democrats, 29 percent Republican, and 39 percent independent.\n\nThe DeSantis campaign said the methodology of the poll is seriously flawed, which “renders the finding useless.”\n\nThe campaign said the sample “has more Independent voters than Democrats or Republicans and more Democrats than Republicans. However, in the 2010, 2012, 2014 and 2016 general elections more Republicans voted than Democrats or Independents.”\n\nStephen Lawson, a DeSantis spokesman, said in a written statement that the poll shows “why so many Americans believe that CNN peddles fake news.”\n\nCNN said its mix of Democrats, Republicans and voters who have no party affiliation or are members of a third party “almost exactly matches” the state’s registered voters.\n\n-- Outlier. Some polls are considered “outliers” by political professionals, meaning that for a variety of reasons they don’t get a good sample and the conclusions raise skepticism. Some political analysts have suggested the CNN poll might be an outlier.\n\nUntil the CNN poll released Sunday, the RealClearPolitics polling average had Gillum and DeSantis just 1 percentage point apart, with 45.3 percent for Gillum and 44.3 percent for DeSantis. Without CNN, the RealClearPolitics average in the Senate race had Scott and Nelson tied at 46.3 percent.\n\nIt’s possible that there’s been a big recent surge toward Gillum and Nelson, or the CNN poll could be an outlier.\n\nThe cable network acknowledged those possibilities in an article it published Monday about the poll. “The CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.”\n\nThe fine print\n\nIn the CNN poll, the research company SSRS used live callers to reach 759 likely voters by phone from Tuesday through Saturday. For likely voters, the pollster said the margin of error was plus or minus 4 percentage points.\n\nSEA said it used live callers to reach 600 registered voters and said its margin of error was plus or minus 4 percentage points.\n\nQuinnipiac surveyed 1,161 likely voters from Wednesday through Sunday using live callers. It reported a margin of error of plus or minus 4 percentage points.\n\naman@sunsentinel.com, 954-356-4550 or Twitter @browardpolitics", "link": "https://www.sun-sentinel.com/news/politics/fl-ne-andrew-gillum-bill-nelson-cnn-poll-20181022-story.html", "published": "2018-10-22T00:00:00"}, {"title": "CNN Poll: Democrats up in Florida with two weeks to go", "text": "WASHINGTON (CNN) As the final two weeks of campaigning begin, Democrats hold an edge in both the gubernatorial and Senate contests in the key state of Florida, according to a new CNN Poll conducted by SSRS. Democratic nominee Andrew Gillum holds a wide 12-point edge over his Republican opponent Rep. Ron DeSantis in the race for governor, while the Senate contest is a closer matchup with incumbent Democratic Sen. Bill Nelson at 50% to Republican Gov. Rick Scott's 45%.\n\nGillum's 54% to 42% lead rests on advantages among women (60% back him vs. 34% who say they favor DeSantis), non-white voters (74% back Gillum, 23% DeSantis), younger voters (60% for Gillum, 33% for DeSantis) and political independents (51% back Gillum, 42% DeSantis). Gillum has also consolidated Democratic support (97% favor him) in a way that DeSantis has not matched on the Republican side (88% back him).\n\nViews of Donald Trump are about as polarizing as partisanship in this race, which Trump has tweeted about multiple times. Among the 51% of likely voters who disapprove of the president, 92% back Gillum, while 87% back DeSantis among the 43% who approve of Trump.\n\nThe poll shows a wider lead for Gillum than some other recent telephone polling, nearly all of which was conducted before Hurricane Michael struck the state on October 10. Before the storm, public polling in mid- to late-September on these contests was mixed, with some (including surveys from Mason-Dixon and the University of North Florida) finding near-even races while others (including the Quinnipiac University and NBC News/Marist polls) gave the Democratic candidates the edge.\n\nThe CNN findings could be an outlier -- a statistical anomaly which occurs in polling by random chance. It also could be an indicator of renewed Democratic enthusiasm.\n\nRead More", "link": "https://www.cnn.com/2018/10/21/politics/cnn-poll-florida-senate-governor/index.html", "published": "2018-10-21T00:00:00"}]}, "cnn_Rick Scott": {"link": "https://www.cnn.com/2018/04/09/politics/rick-scott-bill-nelson-florida/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Dean Heller": {"link": "https://www.cnn.com/2017/07/19/politics/dean-heller-trump/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Jacky Rosen": {"link": "https://www.cnn.com/2018/10/06/politics/womens-vote-key-states/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Claire McCaskill": {"link": "https://www.cnn.com/2018/09/22/politics/islam-claire-mccaskill-radio-ad/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}, "cnn_Josh Hawley": {"link": "https://www.cnn.com/2018/10/01/politics/cnn-polls-missouri-nevada-senate/index.html", "articles": [{"title": "Rick Scott announces that he's running for Senate, challenging Bill Nelson", "text": "Washington (CNN) Florida Republican Gov. Rick Scott launched his long-anticipated challenge to Democratic Sen. Bill Nelson on Monday, officially kicking off one of 2018's most important -- and likely most expensive -- races.\n\nScott announced his entry into the race in interviews and a video posted on his social media accounts reviewing his two terms as governor.\n\n\"I never planned to fit in, and I won't fit in in Washington, either,\" Scott says in the video . \"It's time to shake that place up. We don't need another politician in Washington. It's full of politicians, and that's why it's broken.\"\n\nScott has served in the governor's mansion since 2011 and has long been courted to join the Senate race.\n\nAsked if he considers himself a \"Donald Trump Republican,\" Scott told Politico: \"I consider myself Rick Scott. I don't consider myself any type of anything.\" The governor would not tell the publication whether the President would campaign for him.\n\nIn a statement following Scott's announcement, Nelson said: \"I've always run every race like there's no tomorrow -- regardless of my opponent.\"\n\nNelson later told CNN's Wolf Blitzer Monday afternoon that \"there are so many differences\" between himself and Scott.\n\n\"I think Rick Scott will say and do anything to try to get elected, but I've always thought that if you just try to do the right thing, the politics is going to take care of itself,\" he said.\n\nScott was the last major Republican recruiting target on a 2018 Senate landscape that features Democrats defending seats in 10 states that Trump won in 2016. He's been viewed as the only Republican with a chance of seriously challenging Nelson.\n\nScott previously won two close races for governor. He's also shown he is willing to spend tens of millions of dollars of his own money on campaigns -- a trait that is especially important in Florida, a large and expensive state for television advertising.\n\nAnticipating Scott's entry into the race, Democrats have spent months readying their attacks on his two terms in Tallahassee.\n\nThe Senate Majority PAC, a Chuck Schumer-aligned super PAC, released a digital ad over the weekend as part of a six-figure campaign this week blasting Scott for cutting businesses' taxes while raising property taxes and slashing education funding.\n\n\"History has proven that if you want to predict how Rick Scott will act, figure out what will benefit his political career and his bank account,\" said J.B. Poersch, the super PAC's president.\n\nIn a memo sent to reporters Monday morning, Democratic Senatorial Campaign Committee executive director Mindy Myers previewed the party's line of attack against Scott by calling him \"self-serving and dishonest\" and saying he is \"looking out for himself at Floridians' expense.\"\n\nMyers said Scott's actions as governor have made him $46 million richer. She also highlighted the deaths of 14 seniors in a nursing home during Hurricane Irma and accused Scott of deflecting blame for the Parkland shooting and the Florida International University bridge collapse that killed six people.\n\nMyers pointed out that Scott's gubernatorial wins in 2010 and 2014 came in tight races, and that Florida has seen a shift in Democrats' favor since Trump took office -- including wins in the St. Petersburg mayoral race and two hotly contested state legislative special elections.\n\n\"Scott's self-serving political brand, his administration's failures and a hostile political environment will all cripple his campaign,\" Myers said.\n\nSouth Dakota Republican Sen. Mike Rounds signaled support for Scott on CNN's \"New Day\" Monday morning, though stopped short of a full endorsement.\n\n\"Senator Nelson is a friend of mine. He is a hard worker. At the same time we need votes,\" he said. \"I would welcome (Scott's) inclusion in the race.\"\n\nThis story has been updated with additional information.", "link": "https://www.cnn.com/2018/04/09/politics/rick-scott-running-senator/index.html", "published": "2018-04-09T00:00:00"}, {"title": "Scott's self-funding: $12.8 million", "text": "He previously spent $75 million of his fortune to win in 2010. Scott's self-funding: $12.8 million\n\nFlorida Gov. Rick Scott dropped $12.8 million of his family’s money into his campaign, according to a late Friday filing.\n\nThe Republican said last year that he would not need to put his own money into the reelection bid, after spending $75 million of his fortune to win in 2010. But he said in recent weeks that outside spending by billionaire Tom Steyer and others prompted him to change his mind.\n\nStory Continued Below\n\nThe former hospital company CEO has declined to say how much he put in but was required to report it to the Florida Division of Elections by the end of October.\n\n( Full 2014 election results)\n\nPublic polling shows a dead heat between Scott and Democrat Charlie Crist.\n\nScott — through his own campaign and the Republican Party of Florida, with which he can freely coordinate — is expected to spend easily more than $100 million on this race. The filings show that the state GOP raised $55 million in the past three months, while the Florida Democratic Party brought in $31 million.\n\nThe Republican Governors Association has now transferred $18.5 million for Scott’s campaign to spend directly.", "link": "https://www.politico.com/story/2014/11/rick-scott-florida-self-funding-112403", "published": "2014-11-01T12:08:42"}, {"title": "Senate Key Race alerts: Florida now a Toss-Up while Tennessee is Lean Republican", "text": "Washington (CNN) Florida Gov. Rick Scott shook up the Senate map Monday with his decision to challenge Democratic Sen. Bill Nelson.\n\nScott's entrance ends months of will-he-or-won't he speculation and brings a sigh of relief for Republicans, who had lacked a credible opponent for Nelson.\n\nThe Sunshine State contest is likely to be one of the most expensive in the country this year, making Scott's net worth of nearly $150 million an added benefit of his candidacy for Republicans. The Republican governor has shown a willingness to dip into his personal funds in previous races.\n\nIf Democrats are to have any hope of reclaiming the Senate majority they will need to hold onto Florida -- and most, if not all, of the other nine states with Democratic incumbents that Trump won in 2016. Republicans currently hold a 51-49 advantage in the Senate, meaning Democrats need a net gain of two seats.\n\nNelson, who is seeking a fourth six-year term in the Senate, started the calendar year with $8 million in the bank. He won his most recent race in 2012 by 13 points over Republican Connie Mack IV while at the same time Barack Obama carried the state by just a single point over Mitt Romney.\n\nRead More", "link": "https://www.cnn.com/2018/04/09/politics/senate-key-races-florida-tennessee/index.html", "published": "2018-04-09T00:00:00"}]}}}